// ==UserScript==
// @name		bro3_display_skill
// @namespace	https://gist.github.com/RAPT21/
// @description	ブラウザ三国志 武将スキル表示拡張 by RAPT
// @include		http://*.3gokushi.jp/*
// @exclude		http://*.3gokushi.jp/maintenance*
// @require		http://ajax.googleapis.com/ajax/libs/jquery/1.3.2/jquery.min.js
// @grant		none
// @author		5zen + RAPT
// @version		1.1 (2015/09/17)
// ==/UserScript==

// 1.0	beyond 3.0.74α (2015/06/28) から 5zen 氏原作のカード表示拡張機能のみ抜粋
// 1.1	トレード出品画面で武将スキル表示対応
//		デッキ画面で合成スキルも表示対応

//================================================
// 定数宣言一式
//================================================

// スキル合成表
var gousei_skill = {
	'剣兵の進撃':['剣兵の進撃', '剣兵防御', '剣兵行軍', '剣兵の強撃'],
	'槍兵の進撃':['槍兵の進撃', '槍兵防御', '槍兵行軍', '槍兵の強撃'],
	'弓兵の進撃':['弓兵の進撃', '弓兵防御', '弓兵行軍', '弓兵の強撃'],
	'騎兵の進撃':['騎兵の進撃', '騎兵防御', '騎兵行軍', '騎兵の強撃'],
	'兵器の進撃':['兵器訓練', '兵器防御', '兵器行軍', '兵器の強撃'],
	'剣兵の強撃':['剣兵の進撃', '剣兵防御', '剣兵強行', '剣兵の猛撃'],
	'槍兵の強撃':['火神の攻勢', '槍兵防御', '槍兵強行', '槍兵の猛撃'],
	'弓兵の強撃':['火神の攻勢', '弓兵防御', '弓兵強行', '弓兵の猛撃'],
	'騎兵の強撃':['火神の攻勢', '騎兵防御', '騎兵行軍', '騎兵の猛撃'],
	'兵器の強撃':['蛮族の襲撃', '兵器防御', '火神の攻勢', '兵器の猛撃'],
	'剣兵の猛撃':['未実装', '未実装', '未実装', '未実装'],
	'槍兵の猛撃':['槍兵の強撃', '槍兵堅守', '石切技術', '槍兵の極撃'],
	'弓兵の猛撃':['弓兵の強撃', '弓兵堅守', '伐採技術', '弓兵の極撃'],
	'騎兵の猛撃':['騎兵の強撃', '騎兵堅守', '製鉄技術', '騎兵の極撃'],
	'兵器の猛撃':['兵器の強撃', '英雄', '製鉄技術', '兵器の極撃'],
	'剣兵の極撃':['剣兵突撃', '剣兵方陣', '練兵修練', '剣兵突覇'],
	'槍兵の極撃':['槍兵突撃', '槍兵方陣', '兵舎修練', '槍兵突覇'],
	'弓兵の極撃':['弓兵突撃', '弓兵方陣', '弓兵修練', '弓兵突覇'],
	'騎兵の極撃':['騎兵突撃', '騎兵方陣', '厩舎修練', '騎兵突覇'],
	'兵器の極撃':['兵器の猛撃', '覇道', '加工知識', '深慮遠謀'],
	'剣兵の大極撃':['剣兵の極撃', '守護神', '剣将の采配', '暴君の覇道'],
	'槍兵の大極撃':['槍兵の極撃', '守護神', '槍将の采配', '槍戟鬼神'],
	'騎兵の大極撃':['騎兵の極撃', '騎兵の聖域', '騎将の采配', '戦蹄轟撃'],
	'弓兵の大極撃':['弓兵の極撃', '弓兵の聖域', '弓将の采配', '天弓雨撃'],
	'兵器の大極撃':['未実装', '未実装', '未実装', '未実装'],
	'剣兵の大神撃':['剣兵の大極撃', '金剛不壊', '剣兵増強', '臥龍覚醒'],
	'槍兵の大神撃':['槍兵の大極撃', '金剛不壊', '槍兵増強', '昭烈帝'],
	'弓兵の大神撃':['弓兵の大極撃', '金剛不壊', '弓兵増強', '大皇帝'],
	'騎兵の大神撃':['騎兵の大極撃', '金剛不壊', '騎兵増強', '魏武王'],
	'兵器の大神撃':['未実装', '未実装', '未実装', '未実装'],
	'剣兵突撃':['未実装', '未実装', '未実装', '未実装'],
	'槍兵突撃':['槍兵強行', '槍兵堅守', '千里行', '槍兵の猛撃'],
	'弓兵突撃':['弓兵強行', '弓兵堅守', '千里行', '弓兵の猛撃'],
	'騎兵突撃':['騎兵強行', '騎兵堅守', '千里行', '騎兵の猛撃'],
	'兵器突撃':['兵器強行', '剣兵堅守', '千里行', '剣兵の猛撃'],
	'剣兵突覇':['剣兵突撃', '練兵修練', '神速', '一騎当千'],
	'槍兵突覇':['槍兵突撃', '兵舎修練', '神速', '一騎当千'],
	'弓兵突覇':['弓兵突撃', '弓兵修練', '神速', '一騎当千'],
	'騎兵突覇':['騎兵突撃', '厩舎修練', '神速', '一騎当千'],
	'兵器突覇':['兵器突撃', '兵器訓練', '神速', '一騎当千'],
	'奇計百出':['伐採技術', '弓兵修練', '剣兵突覇', '守護神'],
	'神算鬼謀':['兵器の極撃', '八卦の陣', '覇道', '神医の術式'],
	'深慮遠謀':['兵舎修練', '王佐の才', '農林知識', '攻城の檄文'],
	'麒麟児':['槍兵の極撃', '一騎当千', '兵器の極撃', '神算鬼謀'],
	'混元一気':['騎兵の極撃', '王者の護り', '騎将の采配', '臥龍覚醒'],
	'連環の計':['深慮遠謀', '城壁補強', '槍兵増強', '兵器の極撃'],
	'蛮族の襲撃':['蛮族の襲撃', '兵器訓練', '製鉄知識', '蛮王の襲撃'],
	'蛮王の襲撃':['一騎当千', '兵舎修練', '兵器の猛撃', '太平要術'],
	'覇王の進撃':['騎兵の猛撃', '騎兵の聖域', '覇道', '飛将'],
	'覇王の強撃':['未実装', '未実装', '未実装', '未実装'],
	'覇王の猛撃':['未実装', '未実装', '未実装', '未実装'],
	'覇王の極撃':['未実装', '未実装', '未実装', '未実装'],
	'喬姫の祈り':['覇王の進撃', '強襲突撃', '傾国', '軍神'],
	'喬姫の激励':['弓兵の極撃', '弓兵突覇', '弓兵の聖域', '弓将の采配'],
	'軍神':['一騎当千', '槍兵方陣', '兵舎修練', '飛将'],
	'武神':['一騎当千', '槍兵の聖域', '兵舎修練', '軍神'],
	'鬼神':['武神', '守護神', '兵舎修練', '神飛将'],
	'燕人武陣':['槍兵の極撃', '槍兵の聖域', '槍将の采配', '軍神'],
	'国士無双':['軍神', '城壁補強', '騎兵の勝鬨', '武神'],
	'剣神降臨':['万夫不当', '剣兵方陣', '剣兵突覇', '剣兵の強攻'],
	'槍神降臨':['万夫不当', '槍兵方陣', '槍兵突覇', '槍兵の強攻'],
	'弓神降臨':['万夫不当', '弓兵方陣', '弓兵突覇', '弓兵の強攻'],
	'騎神降臨':['万夫不当', '騎兵方陣', '騎兵突覇', '騎兵の強攻'],
	'英雄':['騎兵の強撃', '騎兵堅守', '奇計百出', '覇道'],
	'覇道':['豪傑', '鉄壁', '千里行', '兵器の極撃'],
	'剛将の畏怖':['一騎当千', '鉄壁', '騎兵強行', '覇道'],
	'太平要術':['兵器の極撃', '槍兵の聖域', '農林技術', '深慮遠謀'],
	'猛虎進撃':['槍兵突覇', '八卦の陣', '急速援護', '槍兵の極撃'],
	'魏王の号令':['騎兵突覇', '騎兵の聖域', '厩舎修練', '富国'],
	'魏王の覇軍':['騎兵突覇', '王者の護り', '覇王の進撃', '魏武王'],
	'暴虐外道':['覇王の進撃', '守護神', '攻城の檄文', '猛将の鹵獲'],
	'暴君の覇道':['猛将の鹵獲', '八卦の陣', '覇道', '暴虐外道'],
	'槍戟鬼神':['槍兵の極撃', '覇道', '千里行', '槍将の采配'],
	'天弓雨撃':['弓兵の極撃', '千里行', '覇道', '弓将の采配'],
	'戦蹄轟撃':['騎兵の極撃', '覇道', '千里行', '騎将の采配'],
	'孫呉の烈火':['大皇帝', '地の利堅壁', '弓将の采配', '神医の施術'],
	'白馬将':['拠点襲撃', '戦蹄轟撃', '騎兵増強', '飛蹄進軍'],

	'精鋭の進撃':['未実装', '未実装', '未実装', '未実装'],
	'臥龍覚醒':['市場繁栄', '八卦の陣', '神算鬼謀', '神医の術式'],
	'醒龍出師':['太平要術', '八卦の陣', '神算鬼謀', '弓兵の勝鬨'],
	'昭烈帝':['槍兵突覇', '王者の護り', '軍神', '神算鬼謀'],
	'大皇帝':['弓兵突覇', '覇王の進撃', '富国', '神医の術式'],
	'魏武王':['騎兵突覇', '城壁補強', '豊穣', '飛将'],
	'蜀軍の極撃':['槍兵の極撃', '富国', '王者の護り', '神算鬼謀'],
	'魏軍の極撃':['騎兵の極撃', '豊穣', '騎兵の聖域', '軍神'],
	'呉軍の極撃':['弓兵の極撃', '加工技術', '守護神', '強兵の檄文'],
	'群雄の極撃':['太平要術', '農林技術', '八卦の陣', '神医の術式'],
	'強襲速撃':['千里行', '弓兵強行', '剣兵強行', '練兵修練'],
	'強襲突撃':['伐採技術', '剣兵の聖域', '槍兵方陣', '強兵の檄文'],
	'強襲突覇':['神速', '鉄壁', '八卦の陣', '攻城の檄文'],
	'強襲烈覇':['強襲突覇', '守護神', '王者の護り', '強兵の檄文'],
	'強襲奮迅':['蛮王の襲撃', '王者の護り', '豊潤祈祷', '奇襲'],
	'胡王の猛襲':['蛮王の襲撃 	', '兵器強行', '覇道', '強襲突覇'],
	'火神の攻勢':['石切知識', '蛮族の襲撃', '練兵訓練', '兵器の強撃'],
	'蛮勇の一撃':['拠点襲撃', '地の利堅壁', '農林技術', '槍兵の極撃'],
	'胡王奮迅':['天弓雨撃', '火神の攻勢', '弓兵の聖域', '奇襲'],
	'趁火打劫':['豪傑', '厩舎訓練', '鉄壁', '奇計百出'],
	'桃族の襲撃':['趁火打劫', '呉の治世', '恵風', '桃色吐息'],
	'猛将の鹵獲':['一騎当千', '守護神', '厩舎修練', '深慮遠謀'],
	'鬼神の鹵獲':['万夫不当', '金剛不壊', '強兵の檄文', '麒麟児'],
	'劉備の大徳':['昭烈帝', '槍兵の聖域', '神医の術式', '醒龍出師'],
	'迅速劫略':['槍兵突覇', '神速援護', '千里行', '猛将の鹵獲'],
	'神速劫略':['発憤興起', '神速', '趁火打劫', '迅速劫略'],
	'豪傑':['剣兵の強撃', '蛮族の襲撃', '槍兵強行', '英雄'],
	'一騎当千':['槍兵突覇', '鉄壁', '加工知識', '魏王の号令'],
	'万夫不当':['騎兵突覇', '神速', '製鉄技術', '騎兵の極撃'],
	'飛将':['一騎当千', '鉄壁', '厩舎修練', '覇王の進撃'],
	'神飛将':['騎兵の極撃', '騎兵の聖域', '神速', '飛将'],
	'無双':['万夫不当', '金剛不壊', '万里行', '覇王の強撃'],
	'隣地猛攻':['一騎当千', '覇道', '強兵の檄文', '強襲突覇'],
	'遠地猛攻':['万夫不当', '覇道', '攻城の檄文', '隣地猛攻'],
	'燕神破軍':['槍兵の大極撃', '守護神', '兵舎修練', '燕人武陣'],
	'龍鱗猛攻':['万夫不当', '覇道', '攻城の檄文', '隣地猛攻'],
	'武将突貫':['豪傑', '鉄壁', '千里行', '一騎当千'],
	'闘将突貫':['一騎当千', '八卦の陣', '神速', '万夫不当'],
	'猛将突貫':['万夫不当', '守護神', '騎兵突覇', '軍神'],
	'隻眼将の軍略':['騎兵の猛撃', '神速', '加工技術', '飛将'],
	'若獅子の軍略':['騎兵突覇', '神速', '加工技術', '鬼神の極意'],
	'苦肉の計':['兵器の極撃', '兵器強行', '兵器修練', '飛将'],
	'皇叔の号令':['昭烈帝', '王者の護り', '豊穣', '神医の術式'],
	'攻城戦の極砕':['兵器の極撃', '兵器修練', '豊穣', '智将砕器'],
	'陥陣営の侵攻':['兵器の猛撃', '兵器強行', '恵風', '攻城の檄文'],
	'智将器撃':['兵器の極撃', '兵器強行', '製鉄技術', '神算鬼謀'],
	'智将砕器':['神算鬼謀', '王者の護り', '智将器撃', '混元一気'],
	'隣地攻城':['兵器の強撃', '城壁補強', '攻城の檄文', '兵器突覇'],
	'守将の出陣':['槍兵方陣', '守護神', '八卦の陣', '槍兵の聖域'],
	'守将の進軍':['兵舎訓練', '加工知識', '騎兵の聖域', '槍兵の極撃'],
	'飛蹄進軍':['騎兵突覇', '騎兵の聖域', '神速', '騎将の采配'],
	'神謀風如':['弓兵の極撃', '王者の護り', '弓兵修練', '勇将飛矢'],
	'急襲':['一騎当千', '守護神', '千里行', '強襲突撃'],
	'奇襲':['猛将の鹵獲', '強襲突覇', '騎将の采配', '飛蹄進軍'],
	'刹那の奇襲':['急襲', '千里行', '厩舎訓練', '弓兵の猛攻'],
	'勇美鼓舞':['一騎当千', '守護神', '富国', '傾国'],
	'麒麟慈心':['万夫不当', '槍兵の聖域', '富国', '槍兵の大極撃'],
	'勇将飛矢':['弓兵の極撃', '弓兵の聖域', '弓兵修練', '覇王の進撃'],
	'勇将天戟':['槍兵の極撃', '槍兵の聖域', '兵舎修練', '覇王の進撃'],
	'拠点襲撃':['槍戟鬼神', '槍兵の聖域', '兵舎修練', '槍兵の大極撃'],
	'剣兵の進攻':['剣兵の進攻', '剣兵防御', '剣兵強行', '槍兵の強撃'],
	'槍兵の進攻':['槍兵の進攻', '槍兵防御', '槍兵強行', '槍兵の強撃'],
	'弓兵の進攻':['弓兵の進攻', '弓兵防御', '弓兵強行', '弓兵の強撃'],
	'騎兵の進攻':['騎兵の進攻', '騎兵防御', '騎兵強行', '騎兵の強撃'],
	'兵器の進攻':['兵器の進攻', '鉄壁', '兵器強行', '兵器の強撃'],
	'剣兵の強攻':['剣兵の強撃', '剣兵防御', '剣兵行軍', '剣兵の強攻'],
	'槍兵の強攻':['槍兵の強撃', '槍兵防御', '槍兵行軍', '槍兵の強攻 '],
	'弓兵の強攻':['弓兵の強撃', '弓兵防御', '弓兵行軍', '弓兵の強攻 '],
	'騎兵の強攻':['騎兵の強撃', '騎兵防御', '騎兵行軍', '騎兵の強攻 '],
	'兵器の強攻':['兵器の強撃', '守護神', '兵器行軍', '兵器の強攻'],
	'剣兵の猛攻':['剣兵の強攻', '剣兵堅守', '食糧技術', '剣兵の猛撃'],
	'槍兵の猛攻':['槍兵の強攻', '槍兵堅守', '石切技術', '槍兵の猛撃'],
	'弓兵の猛攻':['弓兵の強攻', '弓兵堅守', '伐採技術', '弓兵の猛撃'],
	'騎兵の猛攻':['騎兵の強攻', '騎兵堅守', '製鉄技術', '騎兵の猛撃'],
	'兵器の猛攻':['兵器の強攻', '八卦の陣', '食糧技術', '兵器の猛撃'],
	'剣兵の極攻':['剣兵の猛撃', '練兵修練', '剣兵の聖域', '剣兵の猛攻'],
	'槍兵の極攻':['槍兵の猛撃', '兵舎修練', '槍兵の聖域', '槍兵の猛攻'],
	'弓兵の極攻':['弓兵の猛撃', '弓兵修練', '弓兵の聖域', '弓兵の猛攻'],
	'騎兵の極攻':['騎兵の猛撃', '騎兵の聖域', '厩舎修練', '騎兵の猛攻'],
	'兵器の極攻':['兵器の猛撃', '兵器の聖域', '兵器修練', '兵器の猛攻'],
	'剣兵速攻':['剣兵突撃', '剣兵強行', '練兵訓練', '剣兵突覇'],
	'槍兵速攻':['槍兵突撃', '槍兵強行', '兵舎訓練', '騎兵突覇'],
	'弓兵速攻':['弓兵突撃', '弓兵強行', '弓兵訓練', '弓兵突覇'],
	'騎兵速攻':['騎兵突撃', '騎兵強行', '厩舎訓練', '騎兵突覇'],
	'兵器速攻':['兵器突撃', '兵器強行', '兵器修練', '兵器突覇'],
	'剣兵突攻':['剣兵突覇', '神速', '練兵修練', '剣兵速攻'],
	'槍兵突攻':['槍兵突覇', '神速', '兵舎修練', '槍兵速攻'],
	'弓兵突攻':['弓兵突覇', '神速', '弓兵修練', '弓兵速攻'],
	'騎兵突攻':['騎兵突覇', '神速', '厩舎修練', '騎兵速攻'],
	'兵器突攻':['兵器突覇', '神速', '兵器修練', '兵器速攻'],
	'鹵獲の強攻':['未実装', '未実装', '未実装', '未実装'],
	'鹵獲の猛攻':['鹵獲の強攻', '八卦の陣', '迅速援護', '猛将の鹵獲'],
	'鹵獲の極攻':['猛将の鹵獲', '王者の護り', '神速援護', '鹵獲の猛攻'],
	'覇王の強攻':['覇王の強撃', '守護神', '神速', '覇王の強攻'],
	'覇王の猛攻':['覇王の強攻', '八卦の陣', '食糧技術', '覇王の猛撃'],
	'老将統帥':['隣地猛攻', '守護神', '弓兵増強', '勇将飛矢'],
	'武将の極意':['豪傑', '鉄壁', '急速援護', '一騎当千'],
	'闘将の極意':['一騎当千', '八卦の陣', '千里行', '武将の極意'],
	'猛将の極意':['万夫不当', '守護神', '神速', '闘将の極意'],
	'猛士の極意':['万夫不当', '守護神', '神速', '闘将の極意'],
	'鬼神の極意':['隣地猛攻', '王者の護り', '迅速擁護', '闘将の極意'],
	'戦神の極意':['隣地猛攻', '王者の護り', '迅速援護', '猛将の極意'],
	'猛暑の極意':['万夫不当', '守護神', '神速', '闘将の極意'],
	'隣地豪襲':['万夫不当', '謀反の進攻', '攻城の檄文', '闘将の極意'],
	'蜀将の督戦':['槍兵の極撃', '槍兵の聖域', '石切技術', '神算鬼謀'],
	'呉将の督戦':['弓兵の極撃', '弓兵の聖域', '伐採技術', '覇王の進撃'],
	'魏将の督戦':['騎兵の極撃', '騎兵の聖域', '製鉄技術', '軍神'],
	'群将の督戦':['兵器の極撃', '王者の護り', '食糧技術', '虐帝の号令'],
	'謀反の進攻':['謀反の進攻', '鉄壁', '千里行', '剣兵の強撃'],
	'謀反の強攻':['英雄', '守護神', '神速', '謀反の強攻'],
	'謀反の猛攻':['未実装', '未実装', '未実装', '未実装'],
	'謀反の極攻':['暴虐外道', '金剛不壊', '神速援護', '謀反の猛攻'],
	'謀反の突攻':['覇道', '守護神', '呉の治世', '謀反の速攻'],
	'謀反の速攻';['英雄', '鉄壁', '王佐の才', '覇道'],
	'背水陣の極攻':['未実装', '未実装', '未実装', '未実装'],
	'弓襲遠攻':['未実装', '未実装', '未実装', '未実装'],
	'守神の進撃':['守将の進軍', '守護神', '槍将の采配', '槍兵の大極撃'],
	'剣兵行軍':['未実装', '未実装', '未実装', '未実装'],
	'槍兵行軍':['槍兵行軍', '槍兵防御', '槍兵の進撃', '神速'],
	'弓兵行軍':['弓兵行軍', '弓兵防御', '弓兵の進撃', '神速'],
	'騎兵行軍':['騎兵行軍', '騎兵防御', '騎兵の進撃', '神速'],
	'兵器行軍':['兵器行軍', '食糧知識', '兵器訓練', '兵器強行'],
	'剣兵強行':['剣兵強行', '剣兵防御', '剣兵の進撃', '剣兵の猛撃'],
	'槍兵強行':['槍兵強行', '槍兵防御', '槍兵の進撃', '槍兵の猛撃'],
	'弓兵強行':['弓兵強行', '弓兵防御', '弓兵の進撃', '八卦の陣'],
	'騎兵強行':['騎兵強行', '騎兵防御', '騎兵の進撃', '一騎当千'],
	'兵器強行':['兵器強行', '食糧技術', '兵器修練', '蛮王の襲撃'],
	'千里行':['兵器強行', '騎兵方陣', '食糧技術', '神速'],
	'万里行':['兵器突撃', '騎兵の聖域', '伐採技術', '迅速援護'],
	'天里行':['兵器突覇', '騎将の采配', '市場繁栄', '神速援護'],
	'神速':['一騎当千', '英雄', '農林知識', '仁君'],
	'烈速':['強襲突撃', '覇道', '加工知識', '闘将突貫'],
	'飛速':['強襲突覇', '太平要術', '豊穣', '猛将突貫'],
	'急速援護':['千里行', '弓兵強行', '剣兵強行', '練兵修練'],
	'迅速援護':['強襲速撃', '兵器強行', '英雄', '加工技術'],
	'神速援護':['未実装', '未実装', '未実装', '未実装'],
	'戦女の行軍':['強襲突覇', '恵風', '神速', '急襲'],
	'神速雷光':['神速', '剣兵方陣', '深慮遠謀', '烈速'],
	'烈速雷光':['神速雷光', '剣兵方陣', '深慮遠謀', '烈速'],
	'飛速雷光':['烈速', '剣兵の聖域', '神算鬼謀', '烈速雷光'],
	'神速行勢':['未実装', '未実装', '未実装', '未実装'],
	'千里雷光':['千里行', '騎兵行軍', '密偵召集', '千里雷光'],
	'万里雷光':['万里行', '強襲突覇', '密偵精鋭', '万里雷光'],
	'天里雷光':['万里行', '強襲突覇', '密偵精鋭', '万里雷光'],
	'凰里雷光':['万里雷光', '強襲烈覇', '市場知識', '天里行'],
	'剣兵防御':['未実装', '未実装', '未実装', '未実装'],
	'槍兵防御':['石切知識', '槍兵の進撃', '槍兵行軍', '槍兵堅守'],
	'弓兵防御':['伐採知識', '弓兵の進撃', '弓兵行軍', '弓兵堅守'],
	'騎兵防御':['製鉄知識', '騎兵の進撃', '騎兵行軍', '騎兵堅守'],
	'兵器防御':['未実装', '未実装', '未実装', '未実装'],
	'剣兵堅守':['食料知識', '剣兵の進撃', '剣兵強行', '剣兵方陣'],
	'槍兵堅守':['石切知識', '槍兵の進撃', '槍兵強行', '槍兵方陣'],
	'弓兵堅守':['弓兵防御', '弓兵の進撃', '弓兵強行', '弓兵方陣'],
	'騎兵堅守':['騎兵防御', '騎兵の進撃', '騎兵強行', '騎兵方陣'],
	'兵器堅守':['未実装', '未実装', '未実装', '未実装'],
	'剣兵方陣':['剣兵堅守', '剣兵の強撃', '剣兵強行', '剣兵の聖域'],
	'槍兵方陣':['槍兵堅守', '槍兵の強撃', '槍兵強行', '槍兵の聖域'],
	'弓兵方陣':['弓兵堅守', '弓兵の強撃', '弓兵強行', '弓兵の聖域'],
	'騎兵方陣':['騎兵堅守', '騎兵の強撃', '騎兵強行', '騎兵の聖域'],
	'兵器方陣':['兵器堅守', '兵器の強撃', '兵器強行', '兵器の聖域'],
	'剣兵の聖域':['剣兵方陣', '練兵修練', '剣兵強行', '八卦の陣'],
	'槍兵の聖域':['槍兵方陣', '兵舎修練', '槍兵強行', '八卦の陣'],
	'弓兵の聖域':['弓兵方陣', '弓兵修練', '弓兵強行', '八卦の陣'],
	'騎兵の聖域':['騎兵方陣', '厩舎修練', '騎兵強行', '八卦の陣'],
	'兵器の聖域':['未実装', '未実装', '未実装', '未実装'],
	'剣兵の大聖域':['剣兵の聖域', '剣兵増強', '剣兵強行', '王者の護り'],
	'槍兵の大聖域':['槍兵の聖域', '槍兵増強', '槍兵強行', '王者の護り'],
	'弓兵の大聖域':['弓兵の聖域', '弓兵増強', '弓兵強行', '王者の護り'],
	'騎兵の大聖域':['騎兵の聖域', '騎兵増強', '騎兵強行', '王者の護り'],
	'剣兵の大神域':['剣兵の大聖域', '剣兵の采配', '神速', '忠節不落'],
	'槍兵の大神域':['槍兵の大聖域', '槍兵の采配', '神速', '忠節不落'],
	'弓兵の大神域':['弓兵の大聖域', '弓兵の采配', '神速', '忠節不落'],
	'騎兵の大神域':['騎兵の大聖域', '騎兵の采配', '神速', '忠節不落'],
	'鉄壁':['槍兵堅守', '豪傑', '騎兵堅守', '守護神'],
	'守護神':['鉄壁', '槍兵方陣', '弓兵方陣', '王者の護り'],
	'金剛不壊':['防将戦法', '槍兵の聖域', '弓兵の聖域', '防将戦略'],
	'護君':['防将戦略', '守護堅陣', '神速援護', '忠節不落'],
	'八卦の陣':['兵器の猛撃', '剣兵の聖域', '槍兵方陣', '王者の護り'],
	'王者の護り':['槍兵方陣', '弓兵方陣', '騎兵方陣', '王佐の才'],
	'忠節不落':['覇道', '鉄壁', '千里行', '八卦の陣'],
	'覇者の護り':['槍兵の聖域', '弓兵の聖域', '騎兵の聖域', '忠節不落'],
	'不撓不屈':['強襲突覇', '守護防陣', '加工技術', '護君'],
	'堅忍不抜':['強襲突覇', '守護防陣', '加工技術', '護君'],
	'勇猛果敢':['強襲突覇', '守護防陣', '加工技術', '護君'],
	'剣将の采配':['剣兵突覇', '富国', '奇計百出', '猛将突貫'],
	'槍将の采配':['槍兵突覇', '市場知識', '奇計百出', '麒麟児'],
	'弓将の采配':['弓兵突覇', '王佐の才', '奇計百出', '飛将'],
	'騎将の采配':['騎兵突覇', '城壁補強', '奇計百出', '市場繁栄'],
	'蜀軍の防衛':['急速援護', '槍兵の聖域', '守護神', '迅速援護'],
	'魏軍の防衛':['迅速援護', '城壁補強', '王者の護り', '守将の進軍'],
	'呉軍の防衛':['迅速援護', '呉の治世', '八卦の陣', '地の利堅壁'],
	'群雄の防衛':['迅速援護', '王者の護り', '城壁補強', '守将の進軍'],
	'擒賊擒王':['槍兵突撃', '八卦の陣', '城壁補強', '王者の護り'],
	'堅牢知略':['弓兵突撃', '八卦の陣', '兵器強行', '攻城の檄文 '],
	'地の利堅壁':['兵器の猛撃', '槍兵方陣', '剣兵の聖域', '王者の護り'],
	'防将戦略':['槍兵の聖域', '弓兵の聖域', '騎兵の聖域', '守護堅陣'],
	'防将戦法':['槍兵方陣', '弓兵方陣', '騎兵方陣', '守護防陣'],
	'守護防陣':['槍兵防御', '弓兵防御', '騎兵防御', '火神の攻勢'],
	'守護堅陣':['槍兵方陣', '弓兵方陣', '騎兵方陣', '覇道'],
	'守護方陣':['槍兵の聖域', '弓兵の聖域', '騎兵の聖域', '守護堅陣'],
	'守護聖陣':['槍将の采配', '弓将の采配', '騎将の采配', '守護方陣'],
	'守衛方陣':['槍兵の聖域', '弓兵の聖域', '騎兵の聖域', '守護堅陣'],
	'守衛聖陣':['槍将の采配', '弓将の采配', '騎将の采配', '守護方陣'],
	'伐採知識':['伐採知識', '槍兵行軍', '練兵訓練', '伐採技術'],
	'石切知識':['石切知識', '弓兵行軍', '兵舎訓練', '石切技術'],
	'製鉄知識':['製鉄知識', '騎兵行軍', '弓兵訓練', '製鉄技術'],
	'食糧知識':['食糧知識', '剣兵行軍', '厩舎訓練', '食糧技術'],
	'伐採技術':['伐採知識', '槍兵強行', '練兵訓練', '農林知識'],
	'石切技術':['石切知識', '弓兵強行', '兵舎訓練', '加工知識'],
	'製鉄技術':['製鉄知識', '騎兵強行', '弓兵訓練', '弓兵修練'],
	'食糧技術':['食糧知識', '剣兵強行', '厩舎訓練', '厩舎修練'],
	'農林知識':['伐採技術', '食糧技術', '槍兵強行', '農林技術'],
	'農林技術':['農林知識', '英雄', '槍兵突覇', '富国'],
	'加工知識':['石切技術', '製鉄技術', '騎兵強行', '加工技術'],
	'加工技術':['加工知識', '鉄壁', '弓兵突覇', '豊穣'],
	'素材知識':['騎兵の極撃', '騎兵の聖域', '英雄', '市場知識'],
	'食糧革命':['剣兵の極撃', '剣兵の聖域', '練兵修練', '食糧技術'],
	'富国':['槍兵の極撃', '槍兵の聖域', '仁君', '豊穣'],
	'恵風':['騎兵の極撃', '騎兵の聖域', '英雄', '市場知識'],
	'豊穣':['弓兵の極撃', '弓兵の聖域', '呉の治世', '富国'],
	'人選眼力':['伐採知識', '石切知識', '製鉄知識', '食糧知識'],
	'才女の音律':['一騎当千', '農林知識', '神速', '闘将の極意'],
	'豊潤祈祷':['剣兵の極撃', '仁君', '練兵修練', '富国'],
	'富国論':['兵器修練', '攻城の檄文', '豊穣', '富国'],
	'聡明叡知':['奇計百出', '八卦の陣', '神速', '飛将'],
	'優姫の敬愛':['一騎当千', '弓兵の聖域', '弓兵修練', '護君'],
	'孫家の恵み':['猛虎進撃', '守護防陣', '市場知識', '守護堅陣'],
	'石切技巧':['豊穣', '石切技術', '富国', '市場繁栄'],
	'伐採技巧':['豊穣', '伐採技術', '富国', '市場繁栄'],
	'製鉄技巧':['豊穣', '製鉄技術', '富国', '市場繁栄'],
	'食糧技巧':['豊穣', '食糧技術', '富国', '市場繁栄'],
	'練兵訓練':['練兵訓練', '剣兵防御', '剣兵の進撃', '練兵修練'],
	'兵舎訓練':['兵舎訓練', '槍兵防御', '槍兵の進撃', '兵舎修練'],
	'弓兵訓練':['弓兵訓練', '弓兵防御', '弓兵の進撃', '弓兵修練'],
	'厩舎訓練':['厩舎訓練', '騎兵防御', '騎兵の進撃', '厩舎修練'],
	'兵器訓練':['兵器訓練', '兵器防御', '兵器の進撃', '兵器修練'],
	'練兵修練':['練兵修練', '剣兵方陣', '剣兵の強撃', '農林技術'],
	'兵舎修練':['豪傑', '槍兵方陣', '槍兵の強撃', '加工技術'],
	'弓兵修練':['豪傑', '弓兵方陣', '弓兵の強撃', '農林技術'],
	'厩舎修練':['豪傑', '騎兵方陣', '騎兵の強撃', '加工技術'],
	'兵器修練':['兵器修練', '豪傑', '兵器の強撃', '加工技術'],
	'攻城の檄文':['兵器修練', '英雄', '強兵の檄文', '神医の術式'],
	'強兵の檄文':['兵舎修練', '守護神', '攻城の檄文', '神医の術式'],
	'剣兵増強':['剣兵の聖域', ' 剣兵増強', '剣兵強行', '王者の護り'],
	'槍兵増強':['市場知識', '一騎当千', '槍兵増強', '強兵の檄文'],
	'弓兵増強':['城壁補強', '神速援護', '弓兵増強', '攻城の檄文'],
	'騎兵増強':['加工技術', '強襲突撃', '騎兵増強', '軍神'],
	'富国強兵':['攻城の檄文', '軍神', '豊穣', '市場繁栄'],
	'老巧の政令':['麒麟児', '地の利堅壁', '富国論', '市場繁栄'],
	'密偵召集':['一騎当千', '鉄壁', '呉の治世', '王佐の才'],
	'師君強兵':['神速援護', '守護堅陣', '剣将の采配', '守護聖陣'],
	'娘々強兵':['攻城の檄文', '八卦の陣', '豊穣', '強兵の檄文'],
	'呉の治世':['奇計百出', '厩舎修練', '製鉄技術', '王佐の才'],
	'王佐の才':['兵器の猛撃', '兵器修練', '呉の治世', '傾国'],
	'賢妃施政':['飛将', '兵器修練', '呉の治世', '傾国'],
	'麗妃都政':['闘将の極意', '八卦の陣', '覇道', '猛将の極意'],
	'陳留王政':['神算鬼謀', '強兵の檄文', '富国', '皇帝の勅令'],
	'徳義為政':['飛蹄進軍  攻城の檄文  王佐の才  神医の術式'],
	'美玉歌舞':['奇計百出', '仁君', '厩舎修練', '王佐の才'],
	'苛政虎舞':['弓兵の強撃', '兵器の極撃', '神速', '飛蹄進軍'],
	'憂姫護国':['覇道', '兵器強行', '農林知識', '飛将'],
	'領地統制':['深慮遠謀', '堅牢知略', '呉の治世', '富国論'],
	'拠点統制':['神算鬼謀', '防将戦法', '王佐の才', '富国論'],
	'仁君':['槍兵の強撃', '兵舎修練', '覇道', '八卦の陣'],
	'弓腰姫の愛':['弓兵の猛撃', '剣兵の極撃', '弓兵修練', '弓将の采配'],
	'桃色吐息':['一騎当千', '仁君', '王佐の才', '趁火打劫'],
	'熊猫の麺匠':['弓兵の猛撃', '剣兵の極撃', '弓兵修練', '弓将の采配'],
	'神医の術式':['八卦の陣', '守護神', '王佐の才', '槍将の采配'],
	'神医の施術':['仁君', '騎兵の聖域', '加工技術', '神医の術式'],
	'劉備の契り':['仁君', '守護神', '呉の治世', '神算鬼謀'],
	'傾国':['騎兵の極撃', '弓兵の聖域', '神医の術式', '強兵の檄文'],
	'才女の瞳':['騎兵突覇', '鉄壁', '覇道', '闘将の極意'],
	'皇后の慈愛':['覇王の進撃', '傾国', '富国', '神医の術式'],
	'優雅な調べ':['攻城の檄文', '八卦の陣', '豊穣', '強兵の檄文'],
	'勇姫督励':['万夫不当', '守護神', '城壁補強', '護君'],
	'文姫の慈愛':['覇王の進撃', '傾国', '富国', '神医の術式'],
	'城壁補強':['万夫不当', '八卦の陣', '豊潤祈祷', '猛将の鹵獲'],
	'発憤興起':['強襲速撃', '槍兵方陣', '鉄壁', '槍兵増強'],
	'舞姫の愛':['未実装', '未実装', '未実装', '未実装'],
	'酔吟吐息':['趁火打劫', '呉の治世', '恵風', '桃色吐息'],
	'護国芳心':['剣兵の極撃', '剣兵方陣', '剛将の畏怖', '神算鬼謀'],
	'護国献心':['剣兵の猛撃', '剣兵堅守', '覇道', '深慮遠謀'],
	'月下羽衣':['傾国', '富国', '市場知識', '覇王の進撃'],
	'市場知識':['農林知識', '千里行', '豪傑', '八卦の陣'],
	'市場繁栄':['傾国', '富国', '豊穣', '弓将の采配'],
	'市場来福':['槍兵速攻', '弓兵速攻', '騎兵速攻', '迅速却略'],
	'速撃の舞':['精鋭の進撃', '加工技術', '守護神', '市場繁栄'],
	'出撃見舞':['覇王の進撃', '守護神', '千里行', '神速'],
	'迅速斥候':['兵器修練', '八卦の陣', '加工技術', '豊穣'],
	'暴姫の命':['強襲突撃', '強兵の檄文', '神速', '猛将の鹵獲'],
	'暴姫の威令':['猛将の鹵獲', '鉄壁', '食糧知識', '護君'],
	'佳人薄命':['猛将の鹵獲', '王者の護り', '城壁補強', '鬼神の鹵獲'],
	'三顧の礼':['強襲突破', '守護神', '神算鬼謀', '深慮遠謀'],
	'槍兵の勝鬨':['槍兵の極撃', '槍兵の聖域', '槍兵突覇', '槍将の采配'],
	'弓兵の勝鬨':['弓兵の極撃', '弓兵の聖域', '弓兵突覇', '弓将の采配'],
	'騎兵の勝鬨':['騎兵の極撃', '騎兵の聖域', '騎兵突覇', '騎将の采配'],
	'兵器の勝鬨':['兵器の極撃', '剣兵の聖域', '兵器突覇', '攻城の檄文'],
	'才媛献策':['深慮遠謀', '神速援護', '富国', '傾国'],
	'才媛眼識':['深慮遠謀', '傾国', '神速援護', '富国'],
	'天子勅令':['趁火打劫', '槍兵の勝鬨', '王佐の才', '富国論'],
	'悲嘆の舞':['騎兵の強撃', '強兵の檄文', '智将器撃', '混元一気'],
	'洛神の舞':['護君', '強兵の檄文', '富国', '槍将の采配'],
	'大華の舞':['覇王の進撃', '攻城の檄文', '豊穣', '弓将の采配'],
	'小華の舞':['弓兵の強撃', '強兵の檄文', '恵風', '豊穣'],
	'勇躍の舞':['守護方陣', '強兵の檄文', '恵風', '剣将の采配'],
	'哀艶の舞':['槍兵突覇', '千里行', '農林技術', '鬼神の極意'],
	'槍兵の大号令':['麒麟慈心', '呉の治世', '槍兵の勝鬨', '智将器撃'],
	'騎兵の大号令':['神算鬼謀', '王佐の才', '騎兵の勝鬨', '奇略布陣'],
	'弓兵の大号令':['勇将飛矢', '呉の治世', '弓兵の勝鬨', '国士無双'],
	'兵器の大号令':['太平要術', '呉の治世', '王佐の才', '忠節不落'],
	'賢女の策略':['兵器の極撃', '王者の護り', '槍将の采配', '智将器撃'],
	'皇帝の勅令':['弓兵の強撃', '兵器の極撃', '神速', '強襲突覇'],
	'虐帝の号令':['兵器の猛撃', '守護神', '覇道', '蛮王の襲撃'],
	'才略謀略':['槍兵の勝鬨', '弓兵の勝鬨', '騎兵の勝鬨', '智将器撃'],
	'奇略布陣':['強襲突覇', '加工技術', '兵器の極撃', '市場繁栄'],
	'密偵精鋭':['兵器の猛撃', '急速援護', '食糧技術', '万夫不当'],
	'大剣兵移送':['強襲突覇', '剣兵の聖域', '錬兵修練', '剣兵の極撃'],
	'矛槍兵移送':['強襲突覇', '槍兵の聖域', '兵舎修練', '槍兵の極撃'],
	'近衛騎兵移送':['迅速援護', '騎兵の聖域', '厩舎修練', '騎兵の極撃'],
	'弩兵移送':['強襲突覇', '弓兵の聖域', '弓舎修練', '弓兵の極撃'],
	'剣兵急配':['強襲突撃', '剣兵方陣', '練兵訓練', '剣兵の猛撃'],
	'槍兵急配':['強襲突撃', '槍兵方陣', '兵舎訓練', '槍兵の猛撃'],
	'弓兵急配':['強襲突撃', '弓兵方陣', '弓兵訓練', '弓兵の猛撃'],
	'騎兵急配':['強襲突撃', '騎兵方陣', '厩舎訓練', '騎兵の猛撃'],
	'衝車急配':['強襲突撃', '剣兵方陣', '兵器訓練', '兵器の猛撃'],
	'万華招来':['万夫不当', '金剛不壊', '神算鬼謀', '神医の術式'],
	'月華の舞':['猛将の極意', '攻城の檄文', '食糧技術', '騎将の采配'],
	'緊急帰還':['槍将の采配', '城壁補強', '加工技術', '槍兵の猛攻'],
	'全軍の進攻令':['全軍の進攻令', '八卦の陣', '奇計百出', '覇王の進撃'],
	'全軍の強攻令':['覇王の強撃', '王者の護り', '深慮遠謀', '全軍の強攻令'],
	'全軍の猛攻令':['全軍の強攻令', '忠節不落', '神算鬼謀', '覇王の猛撃'],
	'全軍の極攻令':['覇王の猛撃', '覇者の護り', '混元一気', '全軍の猛攻令'],
	'槍兵の大天撃':['槍兵の大神撃', '護君', '強兵の檄文', '蜀軍の極撃'],
	'弓兵の大天撃':['弓兵の大神撃', '護君', '強兵の檄文', '呉軍の極撃'],
	'騎兵の大天撃':['騎兵の大神撃', '護君', '強兵の檄文', '魏軍の極撃'],
	'剣兵の大天撃':['剣兵の大神撃', '護君', '攻城の檄文', '群雄の極撃'],
	'千華招来':['一騎当千', '守護神', '深慮遠謀', '桃色吐息'],
	'飛速迅雷':['烈速', '剣兵の聖域', '神算鬼謀', '烈速雷光'],
	'収奪の猛攻':['鹵獲の強攻', '八卦の陣', '迅速擁護', '猛将の鹵獲'],
	'帝妃都政':['奇計百出', '厩舎修練', '製鉄技術', '王佐の才'],
	'娘々武神':['一騎当千', '槍兵の聖域', '兵舎修練', '軍神'],
	'王将の心意気':['軍神', '城壁補強', '騎兵の勝鬨', '武神'],
	'食糧革命':['剣兵の極撃', '剣兵の聖域', '練兵修練', '食糧技術'],
	'護国望心':['剣兵の強撃', '剣兵防御', '英雄', '奇計百出'],
	'':['', '', '', '']
};

// カードIDからレアリティ引く際に使うようにしているため、メンテ必須かつ移動禁止(2014/12/20)
var card_list =	{
	"1001":{n:"劉備",  r:"R", c:2.5, a:260, i:10, d1:330, bs:"仁君"},
	"1002":{n:"諸葛亮",  r:"SR", c:3.5, a:400, i:25, d1:495, bs:"神算鬼謀"},
	"1003":{n:"関羽",  r:"SR", c:4, a:475, i:13, d1:625, bs:"軍神"},
	"1004":{n:"張飛",  r:"SR", c:3, a:360, i:7, d1:295, bs:"槍兵の猛撃"},
	"1005":{n:"趙雲",  r:"R", c:3, a:335, i:10, d1:345, bs:"騎兵突撃"},
	"1006":{n:"馬超",  r:"SR", c:3, a:350, i:5, d1:322, bs:"騎兵の猛撃"},
	"1007":{n:"劉備",  r:"UC", c:2.5, a:245, i:10, d1:325, bs:"仁君"},
	"1008":{n:"諸葛亮",  r:"R", c:2.5, a:190, i:17, d1:275, bs:"食糧知識"},
	"1009":{n:"諸葛亮",  r:"UC", c:2.5, a:190, i:16, d1:260, bs:"奇計百出"},
	"1010":{n:"関羽",  r:"UC", c:2.5, a:270, i:7, d1:295, bs:"槍兵の進撃"},
	"1011":{n:"関羽",  r:"R", c:2.5, a:285, i:7, d1:300, bs:"槍兵の進撃"},
	"1012":{n:"張飛",  r:"UC", c:2.5, a:290, i:4, d1:230, bs:"豪傑"},
	"1013":{n:"張飛",  r:"C", c:2.5, a:275, i:4, d1:230, bs:"豪傑"},
	"1014":{n:"徐庶",  r:"UC", c:2, a:220, i:15, d1:300, bs:"奇計百出"},
	"1015":{n:"黄忠",  r:"UC", c:2, a:235, i:5, d1:255, bs:"弓兵突撃"},
	"1016":{n:"?統 ",  r:"R", c:2.5, a:240, i:23, d1:260, bs:"兵器の進撃"},
	"1017":{n:"廖化",  r:"UC", c:2, a:205, i:5, d1:235, bs:"槍兵防御"},
	"1018":{n:"廖化",  r:"C", c:2, a:200, i:5, d1:225, bs:"槍兵防御"},
	"1019":{n:"馬岱",  r:"UC", c:2.5, a:245, i:6, d1:245, bs:"騎兵の進撃"},
	"1020":{n:"馬岱",  r:"C", c:2.5, a:235, i:6, d1:245, bs:"騎兵の進撃"},
	"1021":{n:"周倉",  r:"UC", c:2, a:220, i:4, d1:125, bs:"豪傑"},
	"1022":{n:"関平",  r:"UC", c:2, a:195, i:7, d1:205, bs:"槍兵の進撃"},
	"1023":{n:"伊籍",  r:"UC", c:2, a:55, i:12, d1:85, bs:"伐採知識"},
	"1024":{n:"伊籍",  r:"C", c:2, a:55, i:12, d1:70, bs:"伐採知識"},
	"1025":{n:"沙摩柯",  r:"UC", c:1.5, a:155, i:1, d1:100, bs:"剣兵の進撃"},
	"1026":{n:"沙摩柯",  r:"C", c:1.5, a:145, i:1, d1:100, bs:"剣兵の進撃"},
	"1027":{n:"簡雍",  r:"UC", c:1.5, a:65, i:9, d1:55, bs:"食糧知識"},
	"1028":{n:"簡雍",  r:"C", c:1.5, a:65, i:9, d1:45, bs:"食糧知識"},
	"1029":{n:"雷銅",  r:"UC", c:2, a:195, i:5, d1:170, bs:"槍兵の進撃"},
	"1030":{n:"雷銅",  r:"C", c:2, a:185, i:5, d1:170, bs:"槍兵の進撃"},
	"1031":{n:"魏延",  r:"UC", c:2.5, a:265, i:7, d1:235, bs:"槍兵突撃"},
	"1032":{n:"魏延",  r:"C", c:2.5, a:250, i:7, d1:235, bs:"槍兵の進撃"},
	"1033":{n:"馬謖",  r:"UC", c:2, a:170, i:13, d1:200, bs:"製鉄知識"},
	"1034":{n:"馬謖",  r:"C", c:2, a:165, i:13, d1:190, bs:"剣兵の進撃"},
	"1035":{n:"劉備",  r:"SR", c:2.5, a:275, i:12, d1:355, bs:"昭烈帝"},
	"1036":{n:"徐庶",  r:"R", c:2, a:220, i:15, d1:320, bs:"八卦の陣"},
	"1037":{n:"趙雲",  r:"SR", c:3.5, a:425, i:17, d1:425, bs:"槍兵突覇"},
	"1038":{n:"黄忠",  r:"R", c:2.5, a:265, i:11, d1:300, bs:"弓兵の猛撃"},
	"1039":{n:"厳顔",  r:"UC", c:2, a:225, i:4, d1:255, bs:"弓兵方陣"},
	"1040":{n:"厳顔",  r:"C", c:2, a:205, i:4, d1:255, bs:"弓兵堅守"},
	"1041":{n:"姜維",  r:"SR", c:3.5, a:400, i:22, d1:435, bs:"麒麟児"},
	"1042":{n:"魏延",  r:"R", c:2.5, a:280, i:8, d1:240, bs:"槍兵の猛撃"},
	"1043":{n:"馬超",  r:"R", c:2.5, a:290, i:3, d1:225, bs:"騎兵突覇"},
	"1044":{n:"夏侯氏",  r:"SR", c:1, a:20, i:9, d1:100, bs:"伐採技巧"},
	"1045":{n:"法正",  r:"UC", c:2.5, a:185, i:16, d1:265, bs:"全軍の進攻令"},
	"1046":{n:"劉備",  r:"UR", c:3.5, a:420, i:20, d1:520, bs:"昭烈帝"},
	"1047":{n:"諸葛亮",  r:"UR", c:3.5, a:400, i:26, d1:495, bs:"臥龍覚醒"},
	"1048":{n:"関羽",  r:"UR", c:4, a:485, i:14, d1:625, bs:"軍神"},
	"1049":{n:"趙雲",  r:"UR", c:3.5, a:430, i:16, d1:530, bs:"強襲突覇"},
	"1050":{n:"張飛",  r:"UR", c:3.5, a:445, i:7, d1:500, bs:"槍兵の極撃"},
	"1051":{n:"馬超",  r:"UR", c:3.5, a:435, i:7, d1:500, bs:"騎兵突覇"},
	"1052":{n:"黄忠",  r:"SR", c:3, a:310, i:13, d1:395, bs:"弓兵突覇"},
	"1053":{n:"黄月英",  r:"SR", c:1, a:10, i:10, d1:90, bs:"槍兵増強"},
	"1054":{n:"甘夫人",  r:"SR", c:1, a:10, i:8, d1:70, bs:"騎兵増強"},
	"1055":{n:"沙摩柯",  r:"R", c:1.5, a:175, i:2, d1:110, bs:"強襲突撃"},
	"1056":{n:"張飛",  r:"R", c:3, a:335, i:5, d1:260, bs:"槍兵の強撃"},
	"1057":{n:"?統 ",  r:"SR", c:2, a:220, i:17, d1:250, bs:"市場繁栄"},
	"1058":{n:"関平",  r:"C", c:2, a:185, i:7, d1:205, bs:"急速援護"},
	"1059":{n:"黄忠",  r:"C", c:2, a:230, i:5, d1:255, bs:"弓兵強行"},
	"1060":{n:"馬岱",  r:"R", c:2.5, a:260, i:7, d1:290, bs:"騎兵の強撃"},
	"1061":{n:"姜維",  r:"UR", c:3.5, a:405, i:23, d1:440, bs:"槍将の采配"},
	"1062":{n:"劉備",  r:"UR", c:3.5, a:420, i:20, d1:520, bs:"蜀軍の極撃"},
	"1063":{n:"趙雲",  r:"UC", c:2.5, a:280, i:8, d1:230, bs:"騎兵の強撃"},
	"1064":{n:"王悦",  r:"SR", c:4, a:450, i:8, d1:440, bs:"勇将天戟"},
	"1065":{n:"孟達",  r:"R", c:3.5, a:405, i:6, d1:410, bs:"迅速劫略"},
	"1066":{n:"魏延",  r:"SR", c:3, a:345, i:8, d1:310, bs:"槍兵の極撃"},
	"1067":{n:"糜夫人",  r:"SR", c:1, a:10, i:9, d1:120, bs:"豊穣"},
	"1068":{n:"周倉",  r:"R", c:2, a:260, i:4, d1:250, bs:"一騎当千"},
	"1069":{n:"伊籍",  r:"R", c:2, a:55, i:16, d1:105, bs:"伐採技術"},
	"1070":{n:"?統 ",  r:"UC", c:2.5, a:180, i:17, d1:240, bs:"兵器の強撃"},
	"1071":{n:"劉禅",  r:"SR", c:1, a:20, i:5, d1:195, bs:"蜀軍の防衛"},
	"1072":{n:"厳顔",  r:"R", c:2, a:230, i:7, d1:265, bs:"弓兵修練"},
	"1073":{n:"黄忠",  r:"R", c:3, a:350, i:12, d1:305, bs:"一騎当千"},
	"1074":{n:"馬岱",  r:"SR", c:3, a:340, i:8, d1:355, bs:"騎兵の極撃"},
	"1075":{n:"黄忠",  r:"UR", c:3.5, a:440, i:13, d1:460, bs:"勇将飛矢"},
	"1076":{n:"姜維",  r:"R", c:3, a:330, i:17, d1:330, bs:"奇計百出"},
	"1077":{n:"敬哀皇后",  r:"SR", c:1, a:10, i:10, d1:145, bs:"護国芳心"},
	"1078":{n:"馬超",  r:"UC", c:2.5, a:270, i:3, d1:225, bs:"豪傑"},
	"1079":{n:"関羽",  r:"UR", c:4, a:500, i:15, d1:625, bs:"武神"},
	"1080":{n:"夏侯覇",  r:"SR", c:3, a:330, i:10, d1:450, bs:"槍兵突覇"},
	"1081":{n:"法正",  r:"SR", c:2.5, a:220, i:19, d1:260, bs:"槍兵の勝鬨"},
	"1082":{n:"馬謖",  r:"R", c:2, a:200, i:15, d1:240, bs:"厩舎修練"},
	"1083":{n:"諸葛亮",  r:"UR", c:3.5, a:400, i:27, d1:495, bs:"醒龍出師"},
	"1084":{n:"徐庶",  r:"SR", c:3, a:310, i:21, d1:400, bs:"智将器撃"},
	"1085":{n:"王平",  r:"R", c:2.5, a:280, i:10, d1:355, bs:"守護神"},
	"1086":{n:"張飛",  r:"UR", c:3.5, a:470, i:8, d1:480, bs:"燕人武陣"},
	"1087":{n:"関興",  r:"SR", c:3.5, a:430, i:10, d1:450, bs:"槍兵の猛撃"},
	"1088":{n:"関平",  r:"R", c:2.5, a:280, i:10, d1:300, bs:"千里行"},
	"1089":{n:"劉備",  r:"R", c:2.5, a:260, i:10, d1:330, bs:"八卦の陣"},
	"1090":{n:"関羽",  r:"UC", c:2.5, a:270, i:7, d1:295, bs:"槍兵突撃"},
	"1091":{n:"張飛",  r:"UC", c:2.5, a:290, i:4, d1:230, bs:"槍兵の強撃"},
	"1092":{n:"魏延",  r:"UR", c:3.5, a:450, i:12, d1:410, bs:"拠点襲撃"},
	"1093":{n:"沙摩柯",  r:"SR", c:2, a:280, i:2, d1:140, bs:"胡王の猛襲"},
	"1094":{n:"馬超",  r:"SR", c:3.5, a:430, i:5, d1:420, bs:"軍神"},
	"1095":{n:"趙雲",  r:"UR", c:4, a:500, i:20, d1:520, bs:"蜀将の督戦"},
	"1096":{n:"関索",  r:"SR", c:3.5, a:400, i:10, d1:470, bs:"勇美鼓舞"},
	"1097":{n:"劉封",  r:"R", c:2.5, a:250, i:8, d1:345, bs:"守護堅陣"},
	"1098":{n:"劉備",  r:"UR", c:3.5, a:460, i:21, d1:535, bs:"皇叔の号令"},
	"1099":{n:"黄忠",  r:"SR", c:3.5, a:430, i:13, d1:430, bs:"老将統帥"},
	"1100":{n:"糜夫人",  r:"R", c:1, a:10, i:10, d1:120, bs:"憂姫護国"},
	"1101":{n:"関羽",  r:"UC", c:3, a:350, i:9, d1:345, bs:"槍兵の強撃"},
	"1102":{n:"姜維",  r:"UR", c:3.5, a:430, i:23, d1:440, bs:"麒麟慈心"},
	"1103":{n:"関銀屏",  r:"SR", c:3, a:320, i:12, d1:320, bs:"槍兵の猛攻"},
	"1104":{n:"夏侯氏",  r:"R", c:1, a:10, i:8, d1:80, bs:"恵風"},
	"1105":{n:"馬謖",  r:"SR", c:2.5, a:230, i:18, d1:300, bs:"矛槍兵移送"},
	"1106":{n:"?統 ",  r:"UR", c:3.5, a:360, i:27, d1:480, bs:"連環の計"},
	"1107":{n:"張飛",  r:"R", c:3.5, a:400, i:5, d1:430, bs:"猛虎進撃"},
	"1108":{n:"王平",  r:"UC", c:2.5, a:260, i:9, d1:340, bs:"槍兵方陣"},
	"1109":{n:"夏侯覇",  r:"R", c:2.5, a:280, i:9, d1:380, bs:"趁火打劫"},
	"1110":{n:"劉備",  r:"UR", c:3.5, a:435, i:20, d1:505, bs:"槍兵の極攻"},
	"1111":{n:"周倉",  r:"SR", c:3, a:345, i:4, d1:335, bs:"迅速劫略"},
	"1112":{n:"関興",  r:"R", c:3, a:330, i:8, d1:355, bs:"発憤興起"},
	"1113":{n:"鮑三娘",  r:"SR", c:2, a:275, i:5, d1:130, bs:"戦女の行軍"},
	"1114":{n:"関索",  r:"R", c:1.5, a:230, i:7, d1:210, bs:"一騎当千"},
	"1115":{n:"黄月英",  r:"UR", c:1, a:20, i:12, d1:120, bs:"賢女の策略"},
	"1116":{n:"馬岱",  r:"R", c:2.5, a:290, i:7, d1:265, bs:"騎兵の強攻"},
	"1117":{n:"馬雲緑",  r:"SR", c:3.5, a:400, i:6, d1:310, bs:"騎神降臨"},
	"1118":{n:"張姫",  r:"SR", c:3.5, a:415, i:8, d1:350, bs:"槍神降臨"},
	"1119":{n:"厳顔",  r:"SR", c:3, a:340, i:9, d1:460, bs:"勇猛果敢"},
	"1120":{n:"雷銅",  r:"R", c:2.5, a:285, i:7, d1:275, bs:"槍兵速攻"},
	"1121":{n:"馬良",  r:"R", c:2, a:150, i:17, d1:260, bs:"槍兵急配"},
	"1122":{n:"蒋欽",  r:"R", c:1.5, a:110, i:13, d1:105, bs:"製鉄技術"},
	"1123":{n:"劉禅",  r:"UC", c:1.5, a:40, i:6, d1:120, bs:"仁君"},
	"1124":{n:"王桃",  r:"UR", c:2, a:265, i:4, d1:140, bs:"桃賊の襲撃"},
	"1125":{n:"劉備・諸葛",  r:"UR", c:4, a:510, i:24, d1:635, bs:"劉備の大徳"},
	"1126":{n:"姜維",  r:"SR", c:1.5, a:150, i:17, d1:255, bs:"槍兵の大号令"},
	"1127":{n:"孫尚香",  r:"R", c:1.5, a:225, i:9, d1:240, bs:"勇姫督励"},
	"1128":{n:"趙雲",  r:"R", c:3.5, a:400, i:17, d1:445, bs:"飛将"},
	"1129":{n:"黄忠",  r:"UC", c:3, a:350, i:12, d1:360, bs:"弓兵の進攻"},
	"1130":{n:"沙摩柯",  r:"UR", c:2, a:295, i:3, d1:185, bs:"胡王奮迅"},
	"1131":{n:"関興",  r:"UR", c:2, a:290, i:11, d1:290, bs:"神速劫略"},
	"1132":{n:"張飛",  r:"UR", c:4, a:525, i:8, d1:500, bs:"燕神破軍"},
	"1133":{n:"張姫",  r:"UC", c:3, a:295, i:7, d1:330, bs:"槍兵速攻"},
	"1134":{n:"孫尚香",  r:"SR", c:1.5, a:210, i:14, d1:265, bs:"劉備の契り"},
	"1135":{n:"趙雲",  r:"SR", c:3.5, a:410, i:10, d1:425, bs:"騎兵の猛攻"},
	"1136":{n:"関羽",  r:"R", c:3, a:320, i:9, d1:335, bs:"騎兵の極撃"},
	"1137":{n:"張飛",  r:"R", c:3, a:330, i:5, d1:330, bs:"槍兵の極撃"},
	"1138":{n:"黄忠",  r:"R", c:3, a:340, i:11, d1:345, bs:"弓兵の極撃"},
	"1139":{n:"穆皇后",  r:"SR", c:1.5, a:20, i:10, d1:200, bs:"賢妃施政"},
	"1140":{n:"姜維",  r:"UC", c:2.5, a:270, i:16, d1:325, bs:"兵器の猛撃"},
	"1141":{n:"諸葛亮",  r:"UR", c:3.5, a:350, i:22, d1:440, bs:"三顧の礼"},
	"1142":{n:"馬雲緑",  r:"R", c:3.5, a:395, i:6, d1:280, bs:"猛将の極意"},
	"1143":{n:"呉蘭",  r:"R", c:4, a:400, i:9, d1:445, bs:"闘将の極意"},
	"1144":{n:"夏侯覇",  r:"UC", c:3, a:330, i:8, d1:320, bs:"闘将突貫"},
	"1145":{n:"廖化",  r:"SR", c:4, a:480, i:7, d1:595, bs:"強襲烈覇"},
	"1146":{n:"関銀屏",  r:"R", c:3.5, a:415, i:10, d1:420, bs:"槍兵突攻"},
	"1147":{n:"王平",  r:"SR", c:4, a:380, i:13, d1:605, bs:"槍兵の大聖域"},
	"1148":{n:"黄月英",  r:"UC", c:3, a:140, i:19, d1:315, bs:"兵舎修練"},
	"1149":{n:"甘夫人",  r:"UC", c:3, a:130, i:17, d1:330, bs:"厩舎修練"},
	"1150":{n:"関銀屏・関羽",  r:"UR", c:4, a:530, i:15, d1:520, bs:"天里雷光"},
	"1151":{n:"沙摩柯",  r:"SR", c:4, a:460, i:3, d1:450, bs:"勇将飛矢"},
	"1152":{n:"黄忠・厳顔",  r:"UR", c:4, a:550, i:15, d1:495, bs:"歴戦の弓将"},
	"1153":{n:"孫尚香",  r:"SR", c:1.5, a:150, i:10, d1:165, bs:"勇躍の舞"},
	"1154":{n:"張姫",  r:"R", c:3.5, a:415, i:8, d1:420, bs:"飛将"},
	"1155":{n:"張苞",  r:"UR", c:4, a:515, i:14, d1:440, bs:"鹵獲の極攻"},
	"1156":{n:"姜維",  r:"SR", c:3.5, a:420, i:20, d1:430, bs:"槍兵の猛攻"},
	"1157":{n:"夏侯氏",  r:"R", c:3, a:360, i:11, d1:370, bs:"燕人武陣"},
	"1158":{n:"甘夫人",  r:"UR", c:2, a:265, i:14, d1:215, bs:"劉備の大徳"},
	"1159":{n:"徐庶",  r:"UR", c:4.0, a:430, i:26, d1:495, bs:"全軍の極攻令"},
	"1160":{n:"関銀屏",  r:"SR", c:4.0, a:450, i:12, d1:490, bs:"全軍の猛攻令"},
	"1164":{n:"王悦",  r:"UR", c:2.5, a:290, i:9, d1:230, bs:"槍兵速攻"},
	"1165":{n:"孟達",  r:"UR", c:4, a:480, i:8, d1:470, bs:"謀反の極攻"},
	"1166":{n:"張苞・関興",  r:"UR", c:4, a:570, i:15, d1:450, bs:"槍兵の大神撃"},
	"1167":{n:"張翼",  r:"SR", c:4, a:485, i:10, d1:470, bs:"槍兵の大極撃"},
	"1168":{n:"馬良",  r:"SR", c:2, a:200, i:18, d1:300, bs:"領地統制"},
	"1169":{n:"鮑三娘",  r:"R", c:3.5, a:380, i:5, d1:395, bs:"騎神降臨"},
	"1170":{n:"敬哀皇后",  r:"R", c:2, a:30, i:10, d1:70, bs:"市場来福"},
	"1171":{n:"劉封",  r:"UC", c:1, a:90, i:7, d1:170, bs:"守護防陣"},
	"1172":{n:"王桃",  r:"UR", c:2, a:240, i:4, d1:210, bs:"蜀軍の極撃"},
	"1173":{n:"関銀屏",  r:"SR", c:3.5, a:405, i:13, d1:480, bs:"戦女の行軍"},
	"1174":{n:"黄月英",  r:"SR", c:1.5, a:100, i:17, d1:210, bs:"衝車急配"},
	"1175":{n:"関平",  r:"UR", c:4, a:490, i:12, d1:500, bs:"飛速雷光"},
	"1176":{n:"馬岱",  r:"SR", c:3.5, a:420, i:8, d1:355, bs:"飛速"},
	"1177":{n:"馬鉄",  r:"UC", c:2, a:200, i:6, d1:195, bs:"烈速"},
	"1179":{n:"馬謖",  r:"UR", c:4, a:370, i:21, d1:810, bs:"槍兵の大神域"},
	"1180":{n:"甘夫人",  r:"SR", c:3.5, a:410, i:16, d1:435, bs:"烈速雷光"},
	"2001":{n:"曹操",  r:"SR", c:3.5, a:415, i:22, d1:520, bs:"魏王の号令"},
	"2002":{n:"司馬懿",  r:"SR", c:3.5, a:385, i:24, d1:535, bs:"深慮遠謀"},
	"2003":{n:"荀彧",  r:"R", c:2, a:25, i:15, d1:135, bs:"王佐の才"},
	"2004":{n:"夏侯惇",  r:"R", c:2.5, a:275, i:6, d1:310, bs:"騎兵の進撃"},
	"2005":{n:"張遼",  r:"SR", c:3, a:320, i:11, d1:390, bs:"覇王の進撃"},
	"2006":{n:"張? ",  r:"R", c:2.5, a:270, i:8, d1:315, bs:"騎兵突撃"},
	"2007":{n:"曹操",  r:"R", c:3, a:310, i:16, d1:370, bs:"英雄"},
	"2008":{n:"曹操",  r:"UC", c:3, a:300, i:15, d1:370, bs:"英雄"},
	"2009":{n:"夏侯惇",  r:"UC", c:2.5, a:260, i:6, d1:305, bs:"騎兵の進撃"},
	"2010":{n:"夏侯淵",  r:"UC", c:2.5, a:275, i:5, d1:270, bs:"弓兵の進撃"},
	"2011":{n:"夏侯淵",  r:"C", c:2.5, a:265, i:5, d1:270, bs:"弓兵の進撃"},
	"2012":{n:"許?",  r:"UC", c:3, a:230, i:3, d1:390, bs:"槍兵防御"},
	"2013":{n:"典韋",  r:"R", c:3, a:225, i:4, d1:395, bs:"鉄壁"},
	"2014":{n:"曹仁",  r:"UC", c:2.5, a:245, i:6, d1:320, bs:"騎兵の進撃"},
	"2015":{n:"曹仁",  r:"C", c:2.5, a:245, i:6, d1:305, bs:"騎兵の進撃"},
	"2016":{n:"徐晃",  r:"UC", c:2.5, a:275, i:9, d1:320, bs:"槍兵突撃"},
	"2017":{n:"于禁",  r:"UC", c:2, a:185, i:9, d1:245, bs:"騎兵防御"},
	"2018":{n:"于禁",  r:"C", c:2, a:185, i:8, d1:245, bs:"騎兵の進撃"},
	"2019":{n:"張? ",  r:"UC", c:2.5, a:255, i:8, d1:310, bs:"騎兵突撃"},
	"2020":{n:"蔡瑁",  r:"UC", c:2, a:180, i:9, d1:235, bs:"弓兵の進撃"},
	"2021":{n:"蔡瑁",  r:"C", c:2, a:175, i:9, d1:225, bs:"弓兵防御"},
	"2022":{n:"文聘",  r:"UC", c:2.5, a:225, i:8, d1:305, bs:"槍兵防御"},
	"2023":{n:"文聘",  r:"C", c:2.5, a:225, i:7, d1:305, bs:"槍兵防御"},
	"2024":{n:"張魯",  r:"UC", c:2, a:70, i:11, d1:170, bs:"食糧知識"},
	"2025":{n:"張魯",  r:"C", c:2, a:70, i:11, d1:150, bs:"食糧知識"},
	"2026":{n:"曹真",  r:"UC", c:2, a:225, i:9, d1:240, bs:"騎兵の進撃"},
	"2027":{n:"張允",  r:"UC", c:1.5, a:130, i:4, d1:165, bs:"弓兵行軍"},
	"2028":{n:"張允",  r:"C", c:1.5, a:135, i:4, d1:130, bs:"弓兵行軍"},
	"2029":{n:"華?",  r:"UC", c:2, a:85, i:13, d1:35, bs:"製鉄知識"},
	"2030":{n:"華?",  r:"C", c:2, a:85, i:12, d1:35, bs:"練兵訓練"},
	"2031":{n:"朱霊",  r:"UC", c:2, a:205, i:7, d1:200, bs:"厩舎訓練"},
	"2032":{n:"朱霊",  r:"C", c:2, a:190, i:7, d1:200, bs:"厩舎訓練"},
	"2033":{n:"曹昂",  r:"UC", c:1.5, a:125, i:6, d1:180, bs:"騎兵防御"},
	"2034":{n:"曹昂",  r:"C", c:1.5, a:125, i:6, d1:165, bs:"騎兵防御"},
	"2035":{n:"楽進",  r:"UC", c:2.5, a:280, i:4, d1:265, bs:"騎兵突撃"},
	"2036":{n:"楽進",  r:"C", c:2.5, a:265, i:4, d1:265, bs:"豪傑"},
	"2037":{n:"曹休",  r:"UC", c:2, a:215, i:7, d1:225, bs:"騎兵防御"},
	"2038":{n:"曹休",  r:"C", c:2, a:200, i:7, d1:225, bs:"騎兵防御"},
	"2039":{n:"曹操",  r:"R", c:2.5, a:270, i:15, d1:300, bs:"覇道"},
	"2040":{n:"賈?",  r:"R", c:2, a:235, i:15, d1:200, bs:"兵器の強撃"},
	"2041":{n:"賈?",  r:"UC", c:2, a:215, i:15, d1:200, bs:"兵器強行"},
	"2042":{n:"郭嘉",  r:"SR", c:2, a:250, i:17, d1:260, bs:"神算鬼謀"},
	"2043":{n:"夏侯惇",  r:"R", c:3, a:330, i:9, d1:345, bs:"騎兵の猛撃"},
	"2044":{n:"夏侯淵",  r:"R", c:3, a:315, i:11, d1:370, bs:"弓兵突撃"},
	"2045":{n:"曹洪",  r:"UC", c:2, a:215, i:5, d1:240, bs:"騎兵の強撃"},
	"2046":{n:"曹洪",  r:"C", c:2, a:210, i:5, d1:235, bs:"剣兵の強撃"},
	"2047":{n:"司馬懿",  r:"R", c:2.5, a:275, i:18, d1:345, bs:"神速"},
	"2048":{n:"甄姫",  r:"R", c:1, a:35, i:8, d1:155, bs:"強兵の檄文"},
	"2049":{n:"典韋",  r:"R", c:3, a:355, i:4, d1:275, bs:"一騎当千"},
	"2050":{n:"典韋",  r:"UC", c:3, a:325, i:4, d1:275, bs:"豪傑"},
	"2051":{n:"曹操",  r:"UR", c:3.5, a:420, i:22, d1:520, bs:"魏武王"},
	"2052":{n:"張遼",  r:"UR", c:3.5, a:490, i:13, d1:625, bs:"覇王の進撃"},
	"2053":{n:"程昱",  r:"R", c:2, a:150, i:17, d1:260, bs:"剣兵急配"},
	"2054":{n:"董昭",  r:"UR", c:4, a:450, i:26, d1:565, bs:"全軍の極攻令"},
	"2055":{n:"曹休",  r:"SR", c:2.5, a:295, i:10, d1:295, bs:"弓兵突攻"},
	"2056":{n:"曹真",  r:"C", c:2, a:220, i:9, d1:240, bs:"騎兵の進撃"},
	"2057":{n:"曹仁",  r:"R", c:2.5, a:260, i:6, d1:385, bs:"騎兵堅守"},
	"2058":{n:"夏侯惇",  r:"UR", c:3.5, a:430, i:13, d1:490, bs:"騎兵の極撃"},
	"2059":{n:"張? ",  r:"SR", c:2.5, a:285, i:8, d1:330, bs:"騎兵の猛撃"},
	"2060":{n:"許?",  r:"UR", c:3.5, a:370, i:8, d1:590, bs:"王者の護り"},
	"2061":{n:"徐晃",  r:"R", c:3, a:315, i:10, d1:345, bs:"槍兵突覇"},
	"2062":{n:"賈?",  r:"SR", c:2, a:235, i:17, d1:270, bs:"市場知識"},
	"2063":{n:"夏侯淵",  r:"UR", c:3.5, a:430, i:11, d1:510, bs:"軍神"},
	"2064":{n:"典韋",  r:"SR", c:3, a:305, i:7, d1:455, bs:"迅速援護"},
	"2065":{n:"司馬懿",  r:"UR", c:3.5, a:385, i:25, d1:535, bs:"騎将の采配"},
	"2066":{n:"曹操",  r:"UR", c:3.5, a:420, i:22, d1:520, bs:"魏軍の極撃"},
	"2067":{n:"張遼",  r:"R", c:3, a:320, i:8, d1:385, bs:"強襲突撃"},
	"2068":{n:"郭嘉",  r:"R", c:2, a:230, i:15, d1:210, bs:"剣兵突覇"},
	"2069":{n:"程昱",  r:"SR", c:2, a:240, i:17, d1:260, bs:"兵器の極撃"},
	"2070":{n:"荀彧",  r:"UC", c:2, a:25, i:15, d1:130, bs:"石切知識"},
	"2071":{n:"許?",  r:"UR", c:3.5, a:340, i:5, d1:640, bs:"守将の進軍"},
	"2072":{n:"甄姫",  r:"SR", c:1, a:35, i:9, d1:155, bs:"農林技術"},
	"2073":{n:"曹丕",  r:"UR", c:3.5, a:420, i:22, d1:540, bs:"魏軍の防衛"},
	"2074":{n:"于禁",  r:"R", c:2, a:200, i:9, d1:265, bs:"騎兵の強撃"},
	"2075":{n:"郭嘉",  r:"SR", c:4, a:400, i:23, d1:485, bs:"全軍の猛攻令"},
	"2076":{n:"郭嘉",  r:"UC", c:2, a:225, i:15, d1:180, bs:"加工知識"},
	"2077":{n:"張遼",  r:"UC", c:2.5, a:280, i:6, d1:265, bs:"騎兵の強撃"},
	"2078":{n:"李典",  r:"R", c:2, a:230, i:12, d1:295, bs:"槍兵の聖域"},
	"2079":{n:"鐘会",  r:"SR", c:3, a:320, i:15, d1:380, bs:"槍兵の極撃"},
	"2080":{n:"曹洪",  r:"R", c:2, a:245, i:5, d1:260, bs:"騎兵突覇"},
	"2081":{n:"曹休",  r:"R", c:2, a:240, i:10, d1:320, bs:"騎兵の聖域"},
	"2082":{n:"卞夫人",  r:"SR", c:1, a:10, i:9, d1:95, bs:"美玉歌舞"},
	"2083":{n:"甄姫",  r:"UR", c:1, a:35, i:10, d1:155, bs:"皇后の慈愛"},
	"2084":{n:"荀彧",  r:"SR", c:2.5, a:220, i:18, d1:200, bs:"神算鬼謀"},
	"2085":{n:"鄧艾",  r:"SR", c:3.5, a:390, i:22, d1:520, bs:"地の利堅壁"},
	"2086":{n:"楽進",  r:"SR", c:3.5, a:430, i:10, d1:435, bs:"猛将の鹵獲"},
	"2087":{n:"張春華",  r:"SR", c:1, a:20, i:9, d1:155, bs:"出撃見舞"},
	"2088":{n:"曹操",  r:"UR", c:3.5, a:480, i:23, d1:520, bs:"魏王の覇軍"},
	"2089":{n:"許?",  r:"SR", c:3.5, a:360, i:5, d1:600, bs:"忠節不落"},
	"2090":{n:"卞夫人",  r:"R", c:1, a:10, i:9, d1:85, bs:"豊穣"},
	"2091":{n:"夏侯惇",  r:"UC", c:3, a:330, i:8, d1:345, bs:"騎兵の強撃"},
	"2092":{n:"典韋",  r:"UR", c:4, a:500, i:8, d1:470, bs:"槍兵の大極撃"},
	"2093":{n:"夏侯淵",  r:"SR", c:3.5, a:410, i:11, d1:440, bs:"弓兵の極撃"},
	"2094":{n:"賈?",  r:"UR", c:3, a:310, i:22, d1:220, bs:"奇略布陣"},
	"2095":{n:"曹彰",  r:"SR", c:3.5, a:430, i:9, d1:420, bs:"天弓雨撃"},
	"2096":{n:"曹操",  r:"R", c:3, a:310, i:16, d1:370, bs:"奇計百出"},
	"2097":{n:"夏侯惇",  r:"UC", c:2.5, a:260, i:6, d1:305, bs:"騎兵の強撃"},
	"2098":{n:"許?",  r:"UC", c:3, a:230, i:3, d1:390, bs:"槍兵方陣"},
	"2099":{n:"華佗",  r:"SR", c:2, a:90, i:18, d1:190, bs:"神医の施術"},
	"2100":{n:"司馬懿",  r:"UR", c:3.5, a:320, i:27, d1:540, bs:"混元一気"},
	"2101":{n:"荀攸",  r:"SR", c:2.5, a:210, i:18, d1:200, bs:"騎兵の勝鬨"},
	"2102":{n:"夏侯惇",  r:"UR", c:3.5, a:435, i:14, d1:480, bs:"魏将の督戦"},
	"2103":{n:"曹植",  r:"SR", c:2, a:25, i:17, d1:80, bs:"強兵の檄文"},
	"2104":{n:"張遼",  r:"UR", c:3.5, a:495, i:13, d1:625, bs:"戦蹄轟撃"},
	"2105":{n:"曹操",  r:"R", c:3, a:300, i:16, d1:370, bs:"騎兵突撃"},
	"2106":{n:"曹仁",  r:"SR", c:3.5, a:400, i:8, d1:360, bs:"隣地猛攻"},
	"2107":{n:"司馬昭",  r:"SR", c:2.5, a:280, i:18, d1:260, bs:"近衛騎兵移送"},
	"2108":{n:"張? ",  r:"UR", c:3.5, a:440, i:16, d1:430, bs:"騎兵の大極撃"},
	"2109":{n:"徐晃",  r:"SR", c:3.5, a:420, i:15, d1:440, bs:"騎兵の猛攻"},
	"2110":{n:"?徳",  r:"SR", c:3.5, a:435, i:13, d1:450, bs:"猛将突貫"},
	"2111":{n:"楽進",  r:"R", c:3, a:325, i:9, d1:370, bs:"槍兵の猛撃"},
	"2112":{n:"辛憲英",  r:"SR", c:1, a:10, i:10, d1:110, bs:"才媛献策"},
	"2113":{n:"夏侯淵",  r:"R", c:3, a:295, i:9, d1:330, bs:"急襲"},
	"2114":{n:"曹操",  r:"UR", c:3.5, a:430, i:22, d1:515, bs:"騎兵の極攻"},
	"2115":{n:"夏侯惇",  r:"SR", c:3.5, a:425, i:11, d1:430, bs:"隻眼将の軍略"},
	"2116":{n:"許?",  r:"R", c:3, a:250, i:4, d1:435, bs:"守将の出陣"},
	"2117":{n:"曹彰",  r:"R", c:3, a:340, i:7, d1:345, bs:"弓兵の強攻"},
	"2118":{n:"司馬懿",  r:"UC", c:2.5, a:200, i:16, d1:240, bs:"覇道"},
	"2119":{n:"典韋・許?",	r:"UR", c:4, a:500, i:9, d1:640, bs:"守神の進撃"},
	"2120":{n:"賈?",  r:"SR", c:1.5, a:150, i:17, d1:220, bs:"騎兵の大号令"},
	"2121":{n:"張春華",  r:"R", c:1, a:15, i:9, d1:135, bs:"才女の瞳"},
	"2122":{n:"辛憲英",  r:"R", c:1, a:10, i:10, d1:100, bs:"聡明叡知"},
	"2123":{n:"張遼",  r:"UC", c:3, a:350, i:8, d1:335, bs:"騎兵の進攻"},
	"2124":{n:"郭嘉",  r:"UR", c:3, a:300, i:22, d1:230, bs:"才略謀略"},
	"2125":{n:"鄧艾",  r:"R", c:3, a:290, i:17, d1:395, bs:"擒賊擒王"},
	"2126":{n:"郭夫人",  r:"UR", c:1.5, a:30, i:10, d1:180, bs:"帝妃都政"},
	"2127":{n:"鐘会",  r:"R", c:2.5, a:200, i:17, d1:320, bs:"堅牢知略"},
	"2128":{n:"司馬炎",  r:"SR", c:2, a:240, i:17, d1:300, bs:"混元一気"},
	"2129":{n:"関羽",  r:"UR", c:4, a:515, i:15, d1:540, bs:"鬼神"},
	"2130":{n:"曹仁",  r:"UR", c:3.5, a:435, i:8, d1:370, bs:"遠地猛攻"},
	"2131":{n:"王元姫",  r:"SR", c:1.5, a:85, i:15, d1:110, bs:"才媛眼識"},
	"2132":{n:"?昭",  r:"SR", c:3, a:320, i:11, d1:460, bs:"堅忍不抜"},
	"2133":{n:"夏侯覇",  r:"R", c:3.5, a:410, i:11, d1:460, bs:"飛将"},
	"2134":{n:"?徳",  r:"R", c:3.5, a:435, i:13, d1:450, bs:"闘将の極意"},
	"2135":{n:"夏侯淵",  r:"UR", c:3.5, a:435, i:11, d1:460, bs:"刹那の奇襲"},
	"2136":{n:"荀攸",  r:"R", c:2, a:150, i:17, d1:260, bs:"騎兵急配"},
	"2137":{n:"于禁",  r:"UR", c:4, a:545, i:11, d1:490, bs:"戦神の極意"},
	"2138":{n:"文聘",  r:"R", c:3.5, a:380, i:9, d1:700, bs:"金剛不壊"},
	"2139":{n:"王異",  r:"UR", c:3.5, a:410, i:10, d1:620, bs:"守護聖陣"},
	"2140":{n:"司馬師・昭",  r:"UR", c:4, a:560, i:24, d1:400, bs:"騎兵の大神撃"},
	"2141":{n:"張允",  r:"R", c:2, a:200, i:8, d1:285, bs:"城壁補強"},
	"2142":{n:"楽進",  r:"SR", c:4, a:480, i:10, d1:460, bs:"騎兵の大極撃"},
	"2143":{n:"丁夫人",  r:"SR", c:1, a:10, i:10, d1:100, bs:"悲嘆の舞"},
	"2144":{n:"趙娥",  r:"R", c:3.5, a:390, i:10, d1:400, bs:"剣神降臨"},
	"2145":{n:"郭夫人",  r:"R", c:2, a:15, i:10, d1:80, bs:"麗妃都政"},
	"2146":{n:"鄧艾",  r:"UC", c:1, a:160, i:9, d1:120, bs:"万夫不当"},
	"2147":{n:"司馬昭",  r:"R", c:3, a:310, i:19, d1:160, bs:"麒麟児"},
	"2148":{n:"曹真",  r:"R", c:3, a:345, i:11, d1:280, bs:"闘将突貫"},
	"2149":{n:"卞夫人",  r:"R", c:1, a:20, i:9, d1:70, bs:"優雅な調べ"},
	"2150":{n:"司馬炎",  r:"R", c:3, a:355, i:16, d1:390, bs:"覇王の強攻"},
	"2151":{n:"朱霊",  r:"R", c:3.5, a:385, i:8, d1:400, bs:"神速雷光"},
	"2152":{n:"荀彧",  r:"SR", c:3, a:280, i:21, d1:450, bs:"隣地攻城"},
	"2153":{n:"曹憲",  r:"SR", c:2, a:260, i:12, d1:245, bs:"神速劫略"},
	"2154":{n:"曹節",  r:"UR", c:2, a:240, i:11, d1:180, bs:"魏軍の極撃"},
	"2155":{n:"曹華",  r:"R", c:3.5, a:390, i:9, d1:405, bs:"飛将"},
	"2156":{n:"夏侯惇",  r:"SR", c:4, a:500, i:12, d1:465, bs:"神飛将"},
	"2157":{n:"徐晃",  r:"UR", c:4, a:525, i:17, d1:520, bs:"隣地豪襲"},
	"2158":{n:"張魯",  r:"UR", c:1.5, a:140, i:14, d1:215, bs:"師君強兵"},
	"2159":{n:"曹丕",  r:"SR", c:4, a:370, i:20, d1:600, bs:"騎兵の大聖域"},
	"2160":{n:"趙娥",  r:"SR", c:4, a:455, i:12, d1:510, bs:"鹵獲の猛攻"},
	"2161":{n:"甄姫",  r:"R", c:1.5, a:35, i:8, d1:160, bs:"万華招来"},
	"2162":{n:"曹昂",  r:"SR", c:2, a:280, i:8, d1:395, bs:"万里行"},
	"2163":{n:"曹休・曹真",  r:"R", c:3.5, a:405, i:12, d1:430, bs:"千里雷光"},
	"2164":{n:"蔡瑁",  r:"R", c:3, a:370, i:10, d1:335, bs:"弓兵の猛攻"},
	"2165":{n:"甄姫",  r:"SR", c:1.5, a:35, i:9, d1:150, bs:"洛神の舞"},
	"2166":{n:"華佗",  r:"R", c:1, a:80, i:11, d1:160, bs:"神医の術式"},
	"2167":{n:"司馬師",  r:"UR", c:4, a:410, i:26, d1:555, bs:"兵器の極攻"},
	"2168":{n:"趙娥",  r:"UR", c:3.5, a:410, i:12, d1:580, bs:"守衛聖陣"},
	"2169":{n:"許?",  r:"UC", c:1.5, a:195, i:3, d1:270, bs:"守護防陣"},
	"2170":{n:"典韋",  r:"UC", c:1.5, a:230, i:4, d1:220, bs:"闘将突貫"},
	"2171":{n:"曹丕",  r:"R", c:3.5, a:315, i:18, d1:405, bs:"全軍の強攻令"},
	"2172":{n:"司馬炎",  r:"UC", c:2.5, a:265, i:15, d1:315, bs:"全軍の進攻令"},
	"2173":{n:"程昱・荀彧",  r:"UR", c:4.0, a:430, i:26, d1:550, bs:"智将砕器"},
	"2174":{n:"夏侯恩",  r:"R", c:3.5, a:415, i:11, d1:460, bs:"剣兵突攻"},
	"2175":{n:"鐘会",  r:"UC", c:2.5, a:190, i:13, d1:295, bs:"兵器突覇"},
	"2176":{n:"閻圃",  r:"UR", c:2.0, a:140, i:20, d1:315, bs:"食糧革命"},
	"2177":{n:"丁夫人",  r:"R", c:1.0, a:10, i:9, d1:90, bs:"剣兵増強"},
	"2178":{n:"夏侯惇",  r:"L", c:4, a:620, i:14, d1:600, bs:"騎兵の大天撃"},
	"2179":{n:"程昱",  r:"UR", c:2, a:250, i:19, d1:435, bs:"拠点統制"},
	"2180":{n:"司馬昭",  r:"UR", c:4, a:360, i:22, d1:765, bs:"騎兵の大神域"},
	"2181":{n:"曹節",  r:"SR", c:3.5, a:335, i:13, d1:640, bs:"守衛方陣"},
	"2182":{n:"郭夫人",  r:"SR", c:4, a:360, i:20, d1:685, bs:"護君"},
	"3001":{n:"孫権",  r:"R", c:2.5, a:180, i:14, d1:295, bs:"呉の治世"},
	"3002":{n:"周瑜",  r:"SR", c:3.5, a:340, i:23, d1:570, bs:"弓将の采配"},
	"3003":{n:"陸遜",  r:"SR", c:3, a:305, i:19, d1:450, bs:"王者の護り"},
	"3004":{n:"孫策",  r:"SR", c:3, a:350, i:9, d1:385, bs:"覇王の進撃"},
	"3005":{n:"甘寧",  r:"R", c:3, a:345, i:6, d1:275, bs:"弓兵の猛撃"},
	"3006":{n:"孫尚香",  r:"SR", c:2, a:210, i:8, d1:255, bs:"弓腰姫の愛"},
	"3007":{n:"呂蒙",  r:"R", c:3, a:320, i:15, d1:370, bs:"深慮遠謀"},
	"3008":{n:"孫権",  r:"UC", c:2.5, a:180, i:12, d1:295, bs:"呉の治世"},
	"3009":{n:"周瑜",  r:"UC", c:2.5, a:200, i:14, d1:365, bs:"弓兵の進撃"},
	"3010":{n:"周瑜",  r:"R", c:2.5, a:200, i:15, d1:385, bs:"弓兵防御"},
	"3011":{n:"程普",  r:"UC", c:2.5, a:220, i:10, d1:295, bs:"兵舎訓練"},
	"3012":{n:"程普",  r:"C", c:2.5, a:220, i:10, d1:280, bs:"槍兵防御"},
	"3013":{n:"黄蓋",  r:"UC", c:2.5, a:250, i:7, d1:230, bs:"兵器行軍"},
	"3014":{n:"諸葛瑾",  r:"UC", c:2, a:135, i:11, d1:220, bs:"伐採知識"},
	"3015":{n:"朱治",  r:"UC", c:2, a:135, i:9, d1:230, bs:"弓兵防御"},
	"3016":{n:"朱治",  r:"C", c:2, a:135, i:9, d1:220, bs:"弓兵防御"},
	"3017":{n:"韓当",  r:"UC", c:2, a:220, i:5, d1:190, bs:"騎兵の進撃"},
	"3018":{n:"韓当",  r:"C", c:2, a:210, i:5, d1:185, bs:"騎兵行軍"},
	"3019":{n:"蘇飛",  r:"UC", c:2, a:160, i:8, d1:235, bs:"弓兵の進撃"},
	"3020":{n:"蘇飛",  r:"C", c:2, a:170, i:8, d1:225, bs:"剣兵の進撃"},
	"3021":{n:"?沢",  r:"UC", c:2, a:125, i:12, d1:105, bs:"石切知識"},
	"3022":{n:"?沢",  r:"C", c:2, a:115, i:12, d1:100, bs:"石切知識"},
	"3023":{n:"蒋欽",  r:"UC", c:2, a:195, i:6, d1:195, bs:"弓兵の進撃"},
	"3024":{n:"蒋欽",  r:"C", c:2, a:185, i:6, d1:190, bs:"弓兵の進撃"},
	"3025":{n:"孫翊",  r:"UC", c:1.5, a:150, i:2, d1:100, bs:"豪傑"},
	"3026":{n:"孫翊",  r:"C", c:1.5, a:140, i:2, d1:100, bs:"豪傑"},
	"3027":{n:"孫匡",  r:"UC", c:1.5, a:110, i:5, d1:160, bs:"弓兵訓練"},
	"3028":{n:"孫匡",  r:"C", c:1.5, a:110, i:5, d1:150, bs:"弓兵防御"},
	"3029":{n:"祖茂",  r:"UC", c:1.5, a:160, i:4, d1:160, bs:"豪傑"},
	"3030":{n:"祖茂",  r:"C", c:1.5, a:150, i:4, d1:160, bs:"槍兵の進撃"},
	"3031":{n:"大喬",  r:"R", c:1, a:20, i:8, d1:140, bs:"富国"},
	"3032":{n:"小喬",  r:"R", c:1, a:25, i:7, d1:170, bs:"強兵の檄文"},
	"3033":{n:"孫堅",  r:"R", c:3, a:320, i:11, d1:395, bs:"剣兵の極撃"},
	"3034":{n:"魯粛",  r:"R", c:2, a:230, i:14, d1:300, bs:"兵器修練"},
	"3035":{n:"魯粛",  r:"UC", c:2, a:230, i:13, d1:280, bs:"槍兵堅守"},
	"3036":{n:"太史慈",  r:"R", c:3.5, a:390, i:8, d1:480, bs:"守護神"},
	"3037":{n:"陸遜",  r:"R", c:2.5, a:260, i:18, d1:355, bs:"八卦の陣"},
	"3038":{n:"周泰",  r:"UC", c:2.5, a:210, i:5, d1:310, bs:"鉄壁"},
	"3039":{n:"周泰",  r:"C", c:2.5, a:210, i:5, d1:300, bs:"槍兵堅守"},
	"3040":{n:"孫権",  r:"SR", c:2.5, a:250, i:13, d1:365, bs:"大皇帝"},
	"3041":{n:"孫策",  r:"R", c:2.5, a:280, i:8, d1:330, bs:"騎兵突撃"},
	"3042":{n:"甘寧",  r:"R", c:2.5, a:290, i:3, d1:225, bs:"一騎当千"},
	"3043":{n:"甘寧",  r:"UC", c:2.5, a:280, i:3, d1:205, bs:"槍兵強行"},
	"3044":{n:"孫堅",  r:"UR", c:3.5, a:420, i:18, d1:520, bs:"大皇帝"},
	"3045":{n:"周瑜",  r:"UR", c:3.5, a:395, i:24, d1:510, bs:"弓兵の極撃"},
	"3046":{n:"孫尚香",  r:"UR", c:2.5, a:240, i:16, d1:320, bs:"市場繁栄"},
	"3047":{n:"孫策",  r:"UR", c:4, a:505, i:10, d1:600, bs:"飛将"},
	"3048":{n:"太史慈",  r:"SR", c:3.5, a:420, i:6, d1:445, bs:"弓兵の猛撃"},
	"3049":{n:"孫策",  r:"UC", c:2.5, a:290, i:6, d1:230, bs:"豪傑"},
	"3050":{n:"孫翊",  r:"R", c:1.5, a:170, i:4, d1:110, bs:"一騎当千"},
	"3051":{n:"黄蓋",  r:"R", c:2.5, a:275, i:9, d1:245, bs:"兵器強行"},
	"3052":{n:"陸遜",  r:"UC", c:2.5, a:210, i:13, d1:340, bs:"弓兵方陣"},
	"3053":{n:"呂蒙",  r:"UR", c:3, a:330, i:4, d1:380, bs:"覇王の進撃"},
	"3054":{n:"甘寧",  r:"SR", c:3, a:340, i:5, d1:310, bs:"強襲突覇"},
	"3055":{n:"魯粛",  r:"UR", c:2, a:150, i:19, d1:455, bs:"緊急帰還"},
	"3056":{n:"大喬",  r:"UR", c:1, a:30, i:9, d1:150, bs:"喬姫の祈り"},
	"3057":{n:"小喬",  r:"UR", c:1, a:35, i:8, d1:180, bs:"喬姫の激励"},
	"3058":{n:"陸遜",  r:"UR", c:3.5, a:395, i:24, d1:540, bs:"王者の護り"},
	"3059":{n:"太史慈",  r:"UC", c:3, a:310, i:8, d1:300, bs:"豪傑"},
	"3060":{n:"孫堅",  r:"UR", c:3.5, a:420, i:20, d1:520, bs:"呉軍の極撃"},
	"3061":{n:"諸葛瑾",  r:"R", c:2, a:180, i:15, d1:260, bs:"伐採技術"},
	"3062":{n:"呂蒙",  r:"UC", c:2.5, a:280, i:11, d1:260, bs:"槍兵突撃"},
	"3063":{n:"程普",  r:"R", c:2.5, a:235, i:11, d1:310, bs:"兵舎修練"},
	"3064":{n:"周泰",  r:"R", c:2.5, a:265, i:5, d1:385, bs:"槍兵の聖域"},
	"3065":{n:"甘寧",  r:"UR", c:3.5, a:440, i:7, d1:505, bs:"隣地猛攻"},
	"3066":{n:"孫権",  r:"UR", c:3.5, a:440, i:20, d1:505, bs:"皇帝の勅令"},
	"3067":{n:"黄蓋",  r:"UR", c:3, a:350, i:11, d1:345, bs:"苦肉の計"},
	"3068":{n:"太史慈",  r:"UR", c:3.5, a:450, i:7, d1:430, bs:"槍戟鬼神"},
	"3069":{n:"魯粛",  r:"SR", c:2.5, a:265, i:18, d1:285, bs:"弓兵の勝鬨"},
	"3070":{n:"孫堅",  r:"UC", c:2.5, a:250, i:13, d1:375, bs:"弓兵の強撃"},
	"3071":{n:"凌統",  r:"R", c:2.5, a:280, i:9, d1:270, bs:"槍兵突覇"},
	"3072":{n:"祖茂",  r:"R", c:1.5, a:180, i:4, d1:175, bs:"覇道"},
	"3073":{n:"徐盛",  r:"R", c:2.5, a:270, i:14, d1:310, bs:"弓兵突覇"},
	"3074":{n:"張昭",  r:"SR", c:2.5, a:170, i:19, d1:280, bs:"富国論"},
	"3075":{n:"丁奉",  r:"R", c:2.5, a:275, i:12, d1:310, bs:"弓兵の聖域"},
	"3076":{n:"張紘",  r:"SR", c:2.5, a:180, i:19, d1:210, bs:"迅速斥候"},
	"3077":{n:"呉夫人",  r:"SR", c:1, a:20, i:9, d1:85, bs:"弓兵増強"},
	"3078":{n:"孫策",  r:"R", c:2.5, a:280, i:8, d1:330, bs:"騎兵突覇"},
	"3079":{n:"周瑜",  r:"UC", c:2.5, a:200, i:14, d1:365, bs:"弓兵修練"},
	"3080":{n:"甘寧",  r:"UC", c:2.5, a:280, i:3, d1:205, bs:"弓兵突撃"},
	"3081":{n:"周瑜",  r:"UR", c:3.5, a:460, i:26, d1:510, bs:"神謀風如"},
	"3082":{n:"甘寧",  r:"SR", c:3.5, a:430, i:12, d1:505, bs:"奇襲"},
	"3083":{n:"孫尚香",  r:"R", c:2, a:240, i:10, d1:255, bs:"弓将の采配"},
	"3084":{n:"太史慈",  r:"UC", c:3, a:340, i:9, d1:300, bs:"弓兵の強撃"},
	"3085":{n:"程普",  r:"SR", c:3, a:330, i:16, d1:380, bs:"槍兵の猛撃"},
	"3086":{n:"諸葛恪",  r:"R", c:2.5, a:180, i:17, d1:265, bs:"弓兵の聖域"},
	"3087":{n:"孫策",  r:"UR", c:4, a:510, i:13, d1:600, bs:"国士無双"},
	"3088":{n:"呉国太",  r:"SR", c:2, a:10, i:9, d1:110, bs:"市場繁栄"},
	"3089":{n:"呂蒙",  r:"UR", c:3.5, a:420, i:23, d1:505, bs:"呉将の督戦"},
	"3090":{n:"孫尚香",  r:"SR", c:2, a:215, i:9, d1:265, bs:"弓兵の勝鬨"},
	"3091":{n:"陸遜",  r:"UR", c:3.5, a:390, i:24, d1:585, bs:"呉軍の防衛"},
	"3092":{n:"朱桓",  r:"UC", c:2.5, a:275, i:9, d1:265, bs:"槍兵の進攻"},
	"3093":{n:"張紘",  r:"R", c:2.5, a:160, i:18, d1:190, bs:"密偵精鋭"},
	"3094":{n:"蒋欽",  r:"R", c:2, a:270, i:7, d1:235, bs:"弓兵の強攻"},
	"3095":{n:"孫堅",  r:"SR", c:3.5, a:410, i:17, d1:505, bs:"拠点襲撃"},
	"3096":{n:"徐盛",  r:"UC", c:2.5, a:280, i:9, d1:275, bs:"弓兵の進攻"},
	"3097":{n:"黄蓋",  r:"SR", c:3.5, a:330, i:15, d1:460, bs:"防将戦略"},
	"3098":{n:"呉国太",  r:"R", c:1, a:10, i:7, d1:80, bs:"市場知識"},
	"3099":{n:"丁奉",  r:"UC", c:2.5, a:270, i:11, d1:345, bs:"弓兵方陣"},
	"3100":{n:"張昭",  r:"UR", c:3, a:230, i:21, d1:230, bs:"老巧の政令"},
	"3101":{n:"凌統",  r:"SR", c:3.5, a:400, i:11, d1:435, bs:"槍戟鬼神"},
	"3102":{n:"陸抗",  r:"R", c:2, a:145, i:17, d1:325, bs:"堅牢知略"},
	"3103":{n:"呉夫人",  r:"R", c:1, a:15, i:8, d1:75, bs:"弓兵増強"},
	"3104":{n:"孫権",  r:"UR", c:3.5, a:440, i:18, d1:460, bs:"弓兵の極攻"},
	"3105":{n:"小喬",  r:"SR", c:1, a:30, i:7, d1:175, bs:"小華の舞"},
	"3106":{n:"虎姉妹",  r:"UR", c:2.5, a:280, i:6, d1:230, bs:"弓兵の強撃"},
	"3107":{n:"大喬",  r:"SR", c:1, a:25, i:8, d1:145, bs:"大華の舞"},
	"3108":{n:"?沢",  r:"R", c:1.5, a:115, i:13, d1:95, bs:"石切技術"},
	"3109":{n:"凌操",  r:"SR", c:3.5, a:415, i:8, d1:425, bs:"弓兵の猛攻"},
	"3110":{n:"諸葛恪",  r:"UC", c:1.5, a:85, i:12, d1:100, bs:"加工知識"},
	"3111":{n:"太史慈",  r:"UR", c:4, a:500, i:8, d1:540, bs:"弓兵の大極撃"},
	"3112":{n:"周泰",  r:"SR", c:3.5, a:410, i:6, d1:505, bs:"不撓不屈"},
	"3113":{n:"虞翻",  r:"SR", c:2.5, a:250, i:18, d1:280, bs:"弩兵移送"},
	"3114":{n:"陸遜・呂蒙",  r:"UR", c:4, a:450, i:27, d1:600, bs:"孫呉の烈火"},
	"3115":{n:"周瑜",  r:"SR", c:1.5, a:150, i:17, d1:255, bs:"弓兵の大号令"},
	"3116":{n:"大喬",  r:"R", c:1, a:10, i:9, d1:110, bs:"優姫の敬愛"},
	"3117":{n:"甘寧",  r:"R", c:3.5, a:420, i:10, d1:400, bs:"飛将"},
	"3118":{n:"孫堅",  r:"UC", c:3, a:345, i:8, d1:325, bs:"槍兵の進攻"},
	"3119":{n:"張紘",  r:"UC", c:1.5, a:75, i:12, d1:110, bs:"弓兵訓練"},
	"3120":{n:"蘇飛",  r:"R", c:2.5, a:285, i:8, d1:275, bs:"弓兵速攻"},
	"3121":{n:"歩隲",  r:"R", c:2, a:150, i:17, d1:260, bs:"弓兵急配"},
	"3122":{n:"歩夫人",  r:"SR", c:1, a:15, i:9, d1:100, bs:"石切技巧"},
	"3123":{n:"孫翊",  r:"SR", c:3, a:340, i:4, d1:345, bs:"騎兵の猛攻"},
	"3124":{n:"韓当",  r:"SR", c:3.5, a:405, i:10, d1:575, bs:"槍兵の猛攻"},
	"3125":{n:"孫権",  r:"SR", c:3.5, a:435, i:15, d1:410, bs:"若獅子の軍略"},
	"3126":{n:"徐氏",  r:"SR", c:1, a:20, i:9, d1:100, bs:"製鉄技巧"},
	"3127":{n:"蒋欽",  r:"SR", c:3, a:340, i:8, d1:345, bs:"弓兵の猛攻"},
	"3128":{n:"孫尚香",  r:"UC", c:3, a:300, i:12, d1:330, bs:"弓兵速攻"},
	"3129":{n:"大虎",  r:"UR", c:2, a:240, i:10, d1:190, bs:"呉軍の極撃"},
	"3130":{n:"小虎",  r:"SR", c:3.5, a:335, i:11, d1:560, bs:"護君"},
	"3131":{n:"孫尚香",  r:"R", c:2.5, a:290, i:10, d1:335, bs:"飛蹄進軍"},
	"3132":{n:"凌操",  r:"UC", c:2.5, a:285, i:8, d1:300, bs:"武将突貫"},
	"3133":{n:"陸抗",  r:"UC", c:2, a:120, i:16, d1:240, bs:"呉の治世"},
	"3134":{n:"朱桓",  r:"SR", c:2.5, a:295, i:9, d1:300, bs:"槍兵突攻"},
	"3135":{n:"凌操",  r:"R", c:3, a:340, i:8, d1:390, bs:"謀反の強攻"},
	"3136":{n:"韓当",  r:"R", c:2.5, a:270, i:7, d1:310, bs:"兵器の進攻"},
	"3137":{n:"徐盛",  r:"SR", c:3.5, a:430, i:12, d1:380, bs:"猛将の鹵獲"},
	"3138":{n:"孫策・周瑜",  r:"UR", c:4, a:580, i:24, d1:500, bs:"弓兵の大神撃"},
	"3139":{n:"潘璋",  r:"SR", c:4, a:490, i:14, d1:480, bs:"弓兵の大極撃"},
	"3140":{n:"大虎",  r:"SR", c:1, a:100, i:9, d1:90, bs:"苛政虎舞"},
	"3141":{n:"孫氏",  r:"R", c:3.5, a:400, i:15, d1:390, bs:"弓神降臨"},
	"3142":{n:"小虎",  r:"R", c:2, a:50, i:10, d1:60, bs:"孫家の恵み"},
	"3143":{n:"虞翻",  r:"UC", c:3, a:230, i:19, d1:250, bs:"食糧技術"},
	"3144":{n:"潘璋",  r:"R", c:3.5, a:430, i:12, d1:405, bs:"猛士の極意"},
	"3145":{n:"張昭",  r:"R", c:3, a:150, i:20, d1:200, bs:"加工技術"},
	"3146":{n:"孫桓",  r:"UR", c:4, a:520, i:15, d1:520, bs:"鬼神の鹵獲"},
	"3147":{n:"歩隲",  r:"UC", c:2, a:130, i:16, d1:250, bs:"剣兵堅守"},
	"3148":{n:"呂蒙",  r:"SR", c:3.5, a:420, i:18, d1:440, bs:"覇王の猛攻"},
	"3149":{n:"周泰",  r:"R", c:3, a:370, i:5, d1:350, bs:"隣地猛攻"},
	"3150":{n:"孫堅",  r:"R", c:3, a:360, i:12, d1:365, bs:"槍兵の猛攻"},
	"3151":{n:"凌統",  r:"UC", c:3, a:340, i:7, d1:340, bs:"万夫不当"},
	"3152":{n:"張昭・張紘",  r:"UR", c:4, a:400, i:27, d1:520, bs:"呉の治世"},
	"3153":{n:"丁奉",  r:"SR", c:4, a:390, i:14, d1:615, bs:"弓兵の大聖域"},
	"3154":{n:"大喬・小喬",  r:"UR", c:4, a:360, i:21, d1:550, bs:"万華招来"},
	"3155":{n:"呉夫人",  r:"UC", c:3, a:150, i:18, d1:390, bs:"弓兵修練"},
	"3156":{n:"小虎",  r:"UR", c:3.5, a:480, i:12, d1:515, bs:"弓襲遠攻"},
	"3157":{n:"孫氏",  r:"SR", c:4, a:490, i:18, d1:465, bs:"孫呉の烈火"},
	"3158":{n:"朱治",  r:"R", c:3.5, a:420, i:10, d1:395, bs:"弓兵突攻"},
	"3159":{n:"太史慈",  r:"SR", c:4, a:510, i:7, d1:565, bs:"鬼神の極意"},
	"3160":{n:"孫策",  r:"R", c:3.5, a:405, i:9, d1:430, bs:"猛将の極意"},
	"3161":{n:"諸葛瑾",  r:"SR", c:1.5, a:200, i:16, d1:190, bs:"徳義為政"},
	"3162":{n:"虞翻",  r:"R", c:3.5, a:275, i:20, d1:420, bs:"全軍の強攻令"},
	"3163":{n:"周姫",  r:"UR", c:4, a:355, i:23, d1:660, bs:"守衛聖陣"},
	"3164":{n:"大喬",  r:"SR", c:3, a:100, i:16, d1:320, bs:"千華招来"},
	"3165":{n:"孫堅",  r:"L", c:4, a:670, i:22, d1:615, bs:"弓兵の大天撃"},
	"3166":{n:"孫尚香",  r:"L", c:3.5, a:530, i:18, d1:505, bs:"無双"},
	"3167":{n:"陸抗",  r:"UR", c:4, a:505, i:25, d1:465, bs:"全軍の極攻令"},
	"3168":{n:"陳武",  r:"SR", c:4, a:485, i:14, d1:400, bs:"全軍の猛攻令"},
	"3169":{n:"虞翻",  r:"UR", c:4, a:380, i:24, d1:800, bs:"弓兵の大神域"},
	"3170":{n:"大虎",  r:"R", c:3, a:310, i:10, d1:430, bs:"剣将の采配"},
	"3171":{n:"甘寧",  r:"L", c:4, a:610, i:14, d1:565, bs:"凰里雷光"},
	"3172":{n:"周姫",  r:"SR", c:4, a:330, i:27, d1:605, bs:"呉の治世"},
	"4001":{n:"呂布",  r:"SR", c:4, a:500, i:3, d1:545, bs:"飛将"},
	"4002":{n:"董卓",  r:"R", c:3, a:325, i:6, d1:300, bs:"剣兵の進撃"},
	"4003":{n:"袁紹",  r:"R", c:2.5, a:220, i:10, d1:350, bs:"弓兵突撃"},
	"4004":{n:"公孫?",	r:"R", c:3, a:315, i:8, d1:345, bs:"騎兵突撃"},
	"4005":{n:"袁術",  r:"R", c:2.5, a:235, i:8, d1:210, bs:"練兵訓練"},
	"4006":{n:"孟獲",  r:"UC", c:2.5, a:270, i:4, d1:240, bs:"蛮族の襲撃"},
	"4007":{n:"孟獲",  r:"C", c:2.5, a:255, i:4, d1:240, bs:"蛮族の襲撃"},
	"4008":{n:"劉焉",  r:"UC", c:2, a:110, i:13, d1:215, bs:"兵器訓練"},
	"4009":{n:"劉焉",  r:"C", c:2, a:110, i:13, d1:195, bs:"弓兵防御"},
	"4010":{n:"劉表",  r:"UC", c:2, a:95, i:14, d1:175, bs:"石切知識"},
	"4011":{n:"劉表",  r:"C", c:2, a:95, i:13, d1:175, bs:"石切知識"},
	"4012":{n:"孔融",  r:"UC", c:2, a:35, i:14, d1:95, bs:"製鉄知識"},
	"4013":{n:"孔融",  r:"C", c:2, a:35, i:13, d1:95, bs:"製鉄知識"},
	"4014":{n:"黄祖",  r:"UC", c:1.5, a:105, i:3, d1:155, bs:"弓兵行軍"},
	"4015":{n:"黄祖",  r:"C", c:1.5, a:105, i:3, d1:145, bs:"弓兵防御"},
	"4016":{n:"牛輔",  r:"UC", c:1.5, a:120, i:2, d1:80, bs:"槍兵行軍"},
	"4017":{n:"牛輔",  r:"C", c:1.5, a:110, i:2, d1:80, bs:"槍兵行軍"},
	"4018":{n:"郭汜",  r:"UC", c:2, a:215, i:1, d1:185, bs:"騎兵行軍"},
	"4019":{n:"郭汜",  r:"C", c:2, a:205, i:1, d1:180, bs:"剣兵の進撃"},
	"4020":{n:"祝融",  r:"UC", c:2.5, a:275, i:3, d1:155, bs:"火神の攻勢"},
	"4021":{n:"祝融",  r:"C", c:2.5, a:260, i:3, d1:155, bs:"火神の攻勢"},
	"4022":{n:"李?",  r:"UC", c:2, a:200, i:2, d1:205, bs:"騎兵の進撃"},
	"4023":{n:"李?",  r:"C", c:2, a:195, i:2, d1:195, bs:"騎兵防御"},
	"4024":{n:"貂蝉",  r:"SR", c:1, a:10, i:10, d1:100, bs:"傾国"},
	"4025":{n:"張角",  r:"SR", c:3.5, a:380, i:19, d1:135, bs:"太平要術"},
	"4026":{n:"袁紹",  r:"R", c:2.5, a:220, i:10, d1:350, bs:"騎兵の聖域"},
	"4027":{n:"袁紹",  r:"UC", c:2.5, a:205, i:9, d1:350, bs:"剣兵の強撃"},
	"4028":{n:"祝融",  r:"R", c:1.5, a:175, i:3, d1:110, bs:"弓兵突覇"},
	"4029":{n:"孟獲",  r:"R", c:3, a:335, i:5, d1:310, bs:"蛮王の襲撃"},
	"4030":{n:"蔡?",  r:"R", c:1, a:10, i:10, d1:125, bs:"攻城の檄文"},
	"4031":{n:"呂布",  r:"UR", c:4, a:510, i:5, d1:545, bs:"飛将"},
	"4032":{n:"公孫?",	r:"SR", c:3, a:340, i:10, d1:350, bs:"騎兵の猛撃"},
	"4033":{n:"孟獲",  r:"SR", c:3, a:365, i:2, d1:290, bs:"蛮王の襲撃"},
	"4034":{n:"董卓",  r:"SR", c:3, a:350, i:8, d1:305, bs:"強襲突覇"},
	"4035":{n:"祝融",  r:"SR", c:2.5, a:280, i:3, d1:190, bs:"弓兵の極撃"},
	"4036":{n:"劉焉",  r:"R", c:2, a:125, i:14, d1:230, bs:"農林知識"},
	"4037":{n:"劉表",  r:"R", c:2, a:110, i:14, d1:195, bs:"加工知識"},
	"4038":{n:"袁術",  r:"UC", c:2, a:185, i:6, d1:190, bs:"練兵修練"},
	"4039":{n:"張角",  r:"UR", c:3.5, a:380, i:22, d1:120, bs:"群雄の極撃"},
	"4040":{n:"貂蝉",  r:"UR", c:1, a:10, i:10, d1:110, bs:"速撃の舞"},
	"4041":{n:"?徳・馬超",	r:"UR", c:4, a:510, i:13, d1:575, bs:"鬼神の鹵獲"},
	"4042":{n:"于吉",  r:"SR", c:2, a:200, i:17, d1:270, bs:"農林技術"},
	"4043":{n:"王異",  r:"SR", c:2.5, a:290, i:9, d1:240, bs:"剣兵の極撃"},
	"4044":{n:"馬騰",  r:"SR", c:3.5, a:410, i:10, d1:425, bs:"騎兵の極撃"},
	"4045":{n:"献帝",  r:"UR", c:1, a:10, i:10, d1:130, bs:"富国強兵"},
	"4046":{n:"公孫?",	r:"UC", c:2.5, a:275, i:8, d1:265, bs:"騎兵強行"},
	"4047":{n:"顔良",  r:"SR", c:3.5, a:435, i:5, d1:350, bs:"飛将"},
	"4048":{n:"文醜",  r:"SR", c:3.5, a:425, i:5, d1:350, bs:"猛将の鹵獲"},
	"4049":{n:"蔡?",  r:"SR", c:1, a:10, i:10, d1:130, bs:"優雅な調べ"},
	"4050":{n:"袁紹",  r:"SR", c:3.5, a:410, i:18, d1:520, bs:"軍神"},
	"4051":{n:"董卓",  r:"UR", c:3.5, a:425, i:18, d1:520, bs:"暴虐外道"},
	"4052":{n:"張角",  r:"R", c:2.5, a:180, i:17, d1:310, bs:"八卦の陣"},
	"4053":{n:"呂布",  r:"UR", c:4, a:520, i:5, d1:545, bs:"神飛将"},
	"4054":{n:"劉表",  r:"SR", c:2.5, a:180, i:18, d1:325, bs:"強兵の檄文"},
	"4055":{n:"公孫?",	r:"UR", c:3.5, a:420, i:11, d1:460, bs:"飛蹄進軍"},
	"4056":{n:"華雄",  r:"SR", c:3.5, a:420, i:8, d1:390, bs:"槍兵の極撃"},
	"4057":{n:"紀霊",  r:"R", c:2.5, a:270, i:6, d1:300, bs:"騎兵の猛撃"},
	"4058":{n:"祝融",  r:"UR", c:3, a:360, i:4, d1:320, bs:"隣地猛攻"},
	"4059":{n:"陳宮",  r:"R", c:2, a:240, i:14, d1:230, bs:"密偵召集"},
	"4060":{n:"袁紹",  r:"UR", c:3.5, a:410, i:20, d1:630, bs:"群雄の防衛"},
	"4061":{n:"厳氏",  r:"SR", c:1, a:20, i:8, d1:120, bs:"憂姫護国"},
	"4062":{n:"郭汜",  r:"R", c:2.5, a:280, i:2, d1:270, bs:"強襲突撃"},
	"4063":{n:"張梁",  r:"R", c:2.5, a:270, i:12, d1:310, bs:"弓兵の強撃"},
	"4064":{n:"張宝",  r:"R", c:2.5, a:200, i:16, d1:230, bs:"兵器強行"},
	"4065":{n:"水鏡娘",  r:"UR", c:1, a:20, i:10, d1:150, bs:"人選眼力"},
	"4066":{n:"貂蝉",  r:"UR", c:1, a:10, i:10, d1:110, bs:"月下羽衣"},
	"4067":{n:"何皇后",  r:"SR", c:1, a:15, i:8, d1:90, bs:"傾国"},
	"4068":{n:"呂布",  r:"R", c:3.5, a:410, i:3, d1:445, bs:"万夫不当"},
	"4069":{n:"張任",  r:"UC", c:2.5, a:280, i:10, d1:300, bs:"槍兵の強撃"},
	"4070":{n:"袁術",  r:"SR", c:3, a:330, i:13, d1:350, bs:"虐帝の号令"},
	"4071":{n:"兀突骨",  r:"UC", c:3, a:300, i:1, d1:355, bs:"守護防陣"},
	"4072":{n:"孟獲",  r:"UR", c:3.5, a:450, i:5, d1:470, bs:"蛮勇の一撃"},
	"4073":{n:"何進",  r:"R", c:2.5, a:255, i:2, d1:265, bs:"槍兵の強攻"},
	"4074":{n:"張宝",  r:"UC", c:2.5, a:190, i:15, d1:220, bs:"趁火打劫"},
	"4075":{n:"高順",  r:"SR", c:3.5, a:410, i:10, d1:450, bs:"陥陣営の侵攻"},
	"4076":{n:"董白",  r:"SR", c:1.5, a:60, i:9, d1:60, bs:"暴姫の命"},
	"4077":{n:"顔良",  r:"R", c:3, a:350, i:5, d1:280, bs:"剛将の畏怖"},
	"4078":{n:"王異",  r:"R", c:2, a:150, i:7, d1:320, bs:"守護堅陣"},
	"4079":{n:"水鏡",  r:"UR", c:1, a:50, i:17, d1:90, bs:"水鏡鑑定"},
	"4080":{n:"水鏡",  r:"SR", c:1, a:30, i:15, d1:80, bs:"水鏡眼識"},
	"4081":{n:"水鏡",  r:"R", c:1, a:15, i:12, d1:70, bs:"水鏡評論"},
	"4082":{n:"水鏡",  r:"UC", c:1, a:10, i:10, d1:60, bs:"水鏡指南"},
	"4083":{n:"文醜",  r:"R", c:3, a:340, i:5, d1:290, bs:"趁火打劫"},
	"4084":{n:"紀霊",  r:"UC", c:2.5, a:270, i:5, d1:245, bs:"騎兵の進攻"},
	"4085":{n:"霊帝",  r:"SR", c:1, a:10, i:5, d1:110, bs:"天子勅令"},
	"4086":{n:"華雄",  r:"R", c:3, a:345, i:4, d1:330, bs:"槍兵の強攻"},
	"4087":{n:"呂布・貂蝉",  r:"UR", c:4, a:540, i:18, d1:490, bs:"鬼神の極意"},
	"4088":{n:"董卓",  r:"SR", c:3.5, a:380, i:21, d1:450, bs:"暴君の覇道V2"},
	"4089":{n:"蔡?",  r:"R", c:1, a:10, i:10, d1:110, bs:"才女の音律"},
	"4090":{n:"張角",  r:"UC", c:3, a:150, i:16, d1:250, bs:"守護防陣"},
	"4091":{n:"呂氏",  r:"SR", c:3.5, a:410, i:4, d1:345, bs:"弓神降臨"},
	"4092":{n:"馬騰",  r:"R", c:3, a:320, i:9, d1:295, bs:"騎兵の強攻"},
	"4093":{n:"陳宮",  r:"UC", c:2, a:230, i:13, d1:190, bs:"兵器突撃"},
	"4094":{n:"鄒氏",  r:"R", c:1, a:15, i:7, d1:75, bs:"桃色吐息"},
	"4095":{n:"水鏡娘",  r:"UR", c:1, a:50, i:17, d1:90, bs:"娘々祈祷0"},
	"4096":{n:"水鏡娘",  r:"SR", c:1, a:30, i:15, d1:80, bs:"娘々祈祷"},
	"4097":{n:"水鏡娘",  r:"R", c:1, a:15, i:12, d1:70, bs:"娘々祈祷"},
	"4098":{n:"水鏡娘",  r:"UC", c:1, a:10, i:10, d1:65, bs:"娘々祈祷"},
	"4099":{n:"水鏡娘",  r:"UR", c:1, a:50, i:17, d1:90, bs:"娘々訓練0"},
	"4100":{n:"水鏡娘",  r:"SR", c:1, a:30, i:15, d1:80, bs:"娘々訓練"},
	"4101":{n:"水鏡娘",  r:"R", c:1, a:15, i:12, d1:70, bs:"娘々訓練"},
	"4102":{n:"水鏡娘",  r:"UC", c:1, a:10, i:10, d1:65, bs:"娘々訓練"},
	"4103":{n:"于吉",  r:"R", c:1.5, a:130, i:13, d1:100, bs:"豊潤祈祷"},
	"4104":{n:"郭汜",  r:"UC", c:1.5, a:200, i:1, d1:175, bs:"趁火打劫"},
	"4105":{n:"馬超",  r:"UR", c:4, a:510, i:5, d1:440, bs:"騎兵の大極撃"},
	"4106":{n:"李?",  r:"R", c:2.5, a:280, i:3, d1:240, bs:"騎兵速攻"},
	"4107":{n:"黄祖",  r:"R", c:1.5, a:200, i:3, d1:195, bs:"密偵精鋭"},
	"4108":{n:"貂蝉",  r:"R", c:1.5, a:10, i:9, d1:90, bs:"桃色吐息"},
	"4109":{n:"張任",  r:"R", c:2.5, a:270, i:10, d1:390, bs:"防将戦法"},
	"4110":{n:"公孫?",	r:"SR", c:3, a:360, i:9, d1:430, bs:"白馬将"},
	"4111":{n:"袁紹",  r:"UR", c:3.5, a:425, i:20, d1:545, bs:"群将の督戦"},
	"4112":{n:"高順",  r:"R", c:3, a:330, i:10, d1:340, bs:"兵器突撃"},
	"4113":{n:"何進",  r:"UC", c:2.5, a:245, i:2, d1:200, bs:"剣兵の進攻"},
	"4114":{n:"祝融",  r:"R", c:3, a:330, i:3, d1:300, bs:"剣兵の強攻"},
	"4115":{n:"郭汜",  r:"SR", c:1, a:190, i:4, d1:125, bs:"天里行"},
	"4116":{n:"董卓",  r:"UR", c:3.5, a:435, i:19, d1:500, bs:"剣兵の極攻"},
	"4117":{n:"花鬘",  r:"SR", c:3.5, a:410, i:6, d1:450, bs:"剣神降臨"},
	"4118":{n:"何皇后",  r:"R", c:1, a:10, i:8, d1:110, bs:"護国献心"},
	"4119":{n:"呂氏",  r:"UC", c:3, a:290, i:3, d1:320, bs:"騎兵速攻"},
	"4120":{n:"兀突骨",  r:"UR", c:4, a:440, i:4, d1:680, bs:"覇者の護り"},
	"4121":{n:"田豊",  r:"SR", c:4, a:380, i:22, d1:710, bs:"剣兵の大聖域"},
	"4122":{n:"貂蝉",  r:"UR", c:1, a:10, i:8, d1:110, bs:"素材知識"},
	"4123":{n:"孟獲",  r:"R", c:3.5, a:395, i:4, d1:550, bs:"王者の護り"},
	"4124":{n:"パンダ(仮)",  r:"UR", c:1.5, a:85, i:13, d1:160, bs:"熊猫の麺匠"},
	"4125":{n:"張梁",  r:"UC", c:3, a:350, i:11, d1:310, bs:"弓兵突覇"},
	"4126":{n:"パンダ(仮)",  r:"R", c:1.5, a:100, i:10, d1:100, bs:"熊猫の猛襲"},
	"4131":{n:"韓遂",  r:"SR", c:2.5, a:280, i:11, d1:290, bs:"騎兵突攻"},
	"4132":{n:"孟優",  r:"R", c:2.5, a:285, i:8, d1:250, bs:"剣兵速攻"},
	"4135":{n:"呂布",  r:"R", c:3.5, a:410, i:3, d1:445, bs:"武将の極意"},
	"4136":{n:"水鏡娘",  r:"C", c:1, a:10, i:10, d1:50, bs:"娘々訓練"},
	"4137":{n:"劉璋",  r:"SR", c:2.5, a:260, i:14, d1:340, bs:"守護聖陣"},
	"4138":{n:"李?",  r:"SR", c:3.5, a:360, i:4, d1:575, bs:"守護方陣"},
	"4139":{n:"文醜・顔良",  r:"UR", c:4, a:570, i:7, d1:390, bs:"鬼神の極意"},
	"4141":{n:"陳宮・高順",  r:"UR", c:4, a:420, i:26, d1:520, bs:"兵器の猛攻"},
	"4142":{n:"劉表",  r:"SR", c:1.5, a:100, i:17, d1:255, bs:"兵器の大号令"},
	"4143":{n:"董白",  r:"R", c:1, a:30, i:8, d1:60, bs:"暴姫の威令"},
	"4144":{n:"華雄",  r:"R", c:3.5, a:420, i:8, d1:390, bs:"猛将の極意"},
	"4145":{n:"花鬘",  r:"R", c:3.5, a:410, i:6, d1:430, bs:"飛将"},
	"4146":{n:"袁紹",  r:"UC", c:3, a:150, i:19, d1:350, bs:"奇計百出"},
	"4147":{n:"劉璋",  r:"UR", c:3.5, a:410, i:20, d1:600, bs:"護君"},
	"4148":{n:"牛輔",  r:"SR", c:3, a:330, i:10, d1:385, bs:"兵器の強攻"},
	"4149":{n:"馬騰",  r:"UC", c:2.5, a:250, i:8, d1:350, bs:"騎兵方陣"},
	"4150":{n:"馬超",  r:"SR", c:3.5, a:430, i:6, d1:420, bs:"若獅子の軍略"},
	"4151":{n:"韓遂",  r:"UC", c:2.5, a:270, i:10, d1:265, bs:"謀反の進攻"},
	"4152":{n:"水鏡娘",  r:"C", c:1, a:10, i:10, d1:50, bs:"娘々訓練"},
	"4153":{n:"水鏡家族",  r:"UR", c:2, a:90, i:18, d1:190, bs:"水鏡の方術"},
	"4154":{n:"水鏡娘",  r:"UR", c:1, a:20, i:10, d1:150, bs:"娘々強兵"},
	"4155":{n:"パンダ(仮)",  r:"SR", c:3.5, a:390, i:13, d1:380, bs:"龍鱗猛攻"},
	"4156":{n:"鄒氏",  r:"SR", c:1, a:15, i:8, d1:85, bs:"酔吟吐息"},
	"4157":{n:"貂蝉",  r:"R", c:1, a:10, i:9, d1:90, bs:"傾国"},
	"4158":{n:"呂氏",  r:"R", c:3.5, a:370, i:4, d1:350, bs:"闘将の極意"},
	"4159":{n:"お江",  r:"UR", c:1, a:10, i:10, d1:100, bs:"傾国"},
	"4160":{n:"劉焉",  r:"SR", c:2.5, a:230, i:19, d1:250, bs:"兵器の勝鬨"},
	"4161":{n:"水鏡娘",  r:"UR", c:3, a:325, i:10, d1:250, bs:"娘々軍神"},
	"4162":{n:"水鏡娘",  r:"UR", c:2, a:240, i:15, d1:200, bs:"群雄の極撃"},
	"4163":{n:"献帝",  r:"SR", c:3, a:100, i:23, d1:100, bs:"陳留王政"},
	"4164":{n:"祝融",  r:"R", c:3.5, a:200, i:4, d1:670, bs:"金剛不壊"},
	"4165":{n:"張遼",  r:"UR", c:4, a:530, i:15, d1:540, bs:"戦神の極意"},
	"4166":{n:"のぶニャが",  r:"UR", c:3, a:330, i:10, d1:300, bs:"万夫必殺"},
	"4167":{n:"織田信長夢",  r:"UR", c:3.5, a:425, i:6, d1:455, bs:"一閃の極意"},
	"4168":{n:"袁譚・袁尚",  r:"UR", c:4, a:570, i:21, d1:550, bs:"剣兵の大神撃"},
	"4169":{n:"鄒氏",  r:"SR", c:1.5, a:15, i:8, d1:80, bs:"哀艶の舞"},
	"4170":{n:"孟優",  r:"SR", c:4, a:470, i:9, d1:505, bs:"剣兵の大極撃"},
	"4171":{n:"王悦",  r:"R", c:3.5, a:395, i:6, d1:400, bs:"槍神降臨"},
	"4172":{n:"韓遂",  r:"R", c:3.5, a:410, i:10, d1:420, bs:"猛士の極意"},
	"4173":{n:"董白",  r:"UC", c:3, a:295, i:7, d1:360, bs:"剣兵速攻"},
	"4174":{n:"貂蝉",  r:"SR", c:1.5, a:10, i:13, d1:150, bs:"月華の舞"},
	"4175":{n:"呂氏",  r:"R", c:3, a:310, i:4, d1:340, bs:"暴姫の命"},
	"4176":{n:"沮授",  r:"UR", c:3.5, a:350, i:27, d1:495, bs:"攻城戦の極砕"},
	"4181":{n:"王美人",  r:"UR", c:1.5, a:50, i:15, d1:210, bs:"佳人薄命"},
	"4182":{n:"蔡?",  r:"SR", c:1, a:100, i:12, d1:120, bs:"文姫の慈愛"},
	"4183":{n:"鄒氏",  r:"R", c:3.5, a:425, i:10, d1:420, bs:"猛暑の極意"},
	"4184":{n:"水鏡娘",  r:"SR", c:3.5, a:405, i:20, d1:505, bs:"鹵獲の猛攻"},
	"4186":{n:"胡車児",  r:"UR", c:2.0, a:280, i:8, d1:205, bs:"強襲奮迅"},
	"4187":{n:"水鏡娘",  r:"SR", c:3.5, a:395, i:18, d1:395, bs:"猛将の鹵獲"},
	"4192":{n:"木鹿大王",  r:"UR", c:4, a:525, i:10, d1:510, bs:"飛将"},
	"4193":{n:"張宝",  r:"SR", c:3.5, a:405, i:22, d1:405, bs:"兵器の猛攻"},
	"4194":{n:"李儒",  r:"SR", c:2.5, a:220, i:18, d1:250, bs:"大剣兵移送"},
	"4204":{n:"水鏡娘",  r:"L", c:4, a:580, i:22, d1:420, bs:"鹵獲の極攻"},
	"4205":{n:"董白",  r:"UR", c:4, a:510, i:11, d1:450, bs:"飛速迅雷"},
	"4206":{n:"劉璋",  r:"SR", c:1, a:80, i:10, d1:230, bs:"守衛聖陣"},
	"4207":{n:"董白",  r:"SR", c:3.5, a:420, i:10, d1:425, bs:"収奪の猛攻"},
	"4208":{n:"劉璋",  r:"R", c:1, a:50, i:9, d1:135, bs:"領地統制"},
	"4209":{n:"審配",  r:"SR", c:4, a:410, i:22, d1:465, bs:"全軍の猛攻令"},
	"4210":{n:"呂布",  r:"L", c:4, a:700, i:6, d1:640, bs:"無双"},
	"4211":{n:"劉焉",  r:"UR", c:1, a:130, i:11, d1:160, bs:"皇叔の号令"},
	"4212":{n:"皇甫嵩",  r:"UR", c:4, a:520, i:23, d1:505, bs:"全軍の極攻令"},
	"4213":{n:"李儒",  r:"UR", c:4, a:370, i:22, d1:720, bs:"剣兵の大神域"},
	"4215":{n:"盧氏",  r:"UR", c:4, a:385, i:25, d1:485, bs:"食糧革命"},
	"5001":{n:"呂布×董卓",  r:"UR", c:4, a:425, i:11, d1:420, bs:""},
	"5002":{n:"張角×何進",  r:"SR", c:3.5, a:310, i:19, d1:400, bs:""},
	"5003":{n:"孫堅×黄祖",  r:"R", c:3, a:270, i:9, d1:385, bs:""},
	"5004":{n:"水鏡娘×パンダ",  r:"R", c:3, a:250, i:13, d1:355, bs:""},
	"5005":{n:"王允×張譲",  r:"UR", c:4, a:365, i:25, d1:520, bs:""},
	"5006":{n:"張繍×典韋",  r:"SR", c:3.5, a:335, i:11, d1:505, bs:""},
	"5007":{n:"公孫?×袁紹",  r:"R", c:3, a:255, i:8, d1:340, bs:""},
	"5008":{n:"曹操×呂布",  r:"UR", c:4, a:480, i:13, d1:385, bs:""},
	"5009":{n:"姜維×鄧艾",  r:"SR", c:3.5, a:330, i:18, d1:500, bs:""},
	"5010":{n:"荀攸×陳宮",  r:"R", c:3, a:200, i:19, d1:430, bs:""},
	"5011":{n:"水鏡娘×パンダ",  r:"SR", c:3, a:270, i:13, d1:365, bs:""},
	"5012":{n:"孫策×太史慈",  r:"UR", c:4, a:500, i:9, d1:480, bs:""},
	"5013":{n:"関羽×顔良",  r:"SR", c:3.5, a:390, i:10, d1:425, bs:""},
	"5014":{n:"楽進×淳于瓊",  r:"R", c:3, a:310, i:7, d1:325, bs:""},
	"5016":{n:"王異×馬超",  r:"UR", c:4, a:490, i:10, d1:455, bs:"剣兵の大神撃"},
	"5017":{n:"賈?×韓遂",	r:"SR", c:3.5, a:350, i:20, d1:390, bs:"才略謀略"},
	"5018":{n:"魏延×楊儀",  r:"R", c:3, a:300, i:16, d1:310, bs:"謀反の猛攻"},
	"5021":{n:"左慈娘×水鏡娘",  r:"UR", c:4, a:340, i:24, d1:605, bs:"守衛聖陣"},
	"8001":{n:"小指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"覇王の猛攻"},
	"8003":{n:"小指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"猛将の極意"},
	"9001":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵の大神撃"},
	"9002":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵の大神撃"},
	"9003":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵の大神撃"},
	"9004":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵の大神撃"},
	"9005":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"万夫不当"},
	"9006":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"金剛不壊"},
	"9007":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"守護聖陣"},
	"9008":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"鬼神の極意"},
	"9009":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"燕陣破軍"},
	"9010":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"鬼神の鹵獲"},
	"9011":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"神医の術式"},
	"9012":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"神速援護"},
	"9013":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"一騎当千"},
	"9014":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"守護神"},
	"9015":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"迅速援護"},
	"9016":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"飛将"},
	"9017":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"猛将の極意"},
	"9018":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"守護方陣"},
	"9019":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"兵器の極攻"},
	"9020":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵の極攻"},
	"9021":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵の極攻"},
	"9022":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵の極攻"},
	"9023":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵の極攻"},
	"9024":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵の大聖域"},
	"9025":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵の大聖域"},
	"9026":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵の大聖域"},
	"9027":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵の大聖域"},
	"9028":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"飛将"},
	"9029":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"飛蹄進軍"},
	"9031":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"護君"},
	"9031":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"千里雷光"},
	"9032":{n:"中指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"隣地豪襲"},
	"10001":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵の大極撃"},
	"10002":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵の猛攻"},
	"10003":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵の大極撃"},
	"10004":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵の猛攻"},
	"10005":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵の大極撃"},
	"10006":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵の猛攻"},
	"10007":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵の大極撃"},
	"10008":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵の猛攻"},
	"10009":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵の極攻"},
	"10010":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵の極攻"},
	"10011":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵の極攻"},
	"10012":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵の極攻"},
	"10013":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"猛将の極意"},
	"10014":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"闘将の極意"},
	"10015":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"猛将の鹵獲"},
	"10016":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"万夫不当"},
	"10017":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"神速"},
	"10018":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"兵器の猛撃"},
	"10019":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"王佐の才"},
	"10020":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"千里雷光"},
	"10021":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"万里雷光"},
	"10022":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵の猛撃"},
	"10023":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵の猛撃"},
	"10024":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵の猛撃"},
	"10025":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵の猛撃"},
	"10026":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"兵器の強撃"},
	"10027":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"豪傑"},
	"10028":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"千里行"},
	"10029":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"八卦の陣"},
	"10030":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"鉄壁"},
	"10031":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵の極撃"},
	"10032":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵の極撃"},
	"10033":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵の極撃"},
	"10034":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵の極撃"},
	"10035":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"一騎当千"},
	"10036":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"王者の護り"},
	"10037":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"守護神"},
	"10038":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"忠節不落"},
	"10039":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"金剛不壊"},
	"10040":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"神飛将"},
	"10041":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"猛士の極意"},
	"10042":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"守護堅陣"},
	"10043":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"智将噐撃"},
	"10044":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"兵器の進攻"},
	"10045":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"兵器の強攻"},
	"10046":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"豊穣"},
	"10047":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"昭烈帝"},
	"10048":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"大皇帝"},
	"10049":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"魏武王"},
	"10050":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵突撃"},
	"10051":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵突撃"},
	"10052":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵突撃"},
	"10053":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵突撃"},
	"10054":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"強襲速撃"},
	"10055":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵突覇"},
	"10056":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵突覇"},
	"10057":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵突覇"},
	"10058":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵突覇"},
	"10059":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"強襲突撃"},
	"10060":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"強襲突覇"},
	"10061":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"飛将"},
	"10062":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"鬼神の極意"},
	"10063":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"神速雷光"},
	"10064":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵の聖域"},
	"10065":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵の聖域"},
	"10066":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵の聖域"},
	"10067":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵の聖域"},
	"10068":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"迅速援護"},
	"10069":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"神速援護"},
	"10070":{n:"中指南パンダ",	r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵の大神撃"},
	"10071":{n:"中指南パンダ",	r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵の大神撃"},
	"10072":{n:"中指南パンダ",	r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵の大神撃"},
	"10073":{n:"中指南パンダ",	r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵の大神撃"},
	"10074":{n:"中指南パンダ",	r:"UR", c:1, a:15, i:10, d1:20, bs:"万夫不当"},
	"10075":{n:"中指南パンダ",	r:"UR", c:1, a:15, i:10, d1:20, bs:"金剛不壊"},
	"10076":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"強襲烈覇"},
	"10077":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣神降臨"},
	"10078":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"守護方陣"},
	"10079":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"鹵獲の強攻"},
	"10080":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"傾国"},
	"10081":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"強襲突覇"},
	"10082":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓神降臨"},
	"10083":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍神降臨"},
	"10084":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎神降臨"},
	"10085":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"隣地豪襲"},
	"10086":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"隣地猛攻"},
	"10087":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"全軍の進攻令"},
	"10088":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"全軍の強攻令"},
	"10092":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵の大神撃"},
	"10093":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵の強攻"},
	"10094":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵の強攻"},
	"10095":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵の強攻"},
	"10096":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵の強攻"},
	"10097":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵速攻"},
	"10098":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵速攻"},
	"10099":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵速攻"},
	"10100":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵速攻"},
	"10101":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"騎兵突攻"},
	"10102":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"弓兵突攻"},
	"10103":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"槍兵突攻"},
	"10104":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"剣兵突攻"},
	"10105":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"守護聖陣"},
	"10106":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"烈速"},
	"10107":{n:"指南パンダ",  r:"UR", c:1, a:15, i:10, d1:20, bs:"烈速雷光"},
};

//--------------------------------------------------------
// カード表示拡張
//--------------------------------------------------------
jQuery.noConflict();
j$ = jQuery;

var SukesukeFlg = 1;

var lv_list = [
	[	14	 ,	 80  ,	 16  ,	 03  ,	1 ] ,
	[	40	 ,	 71  ,	 21  ,	 06  ,	2 ] ,
	[	66	 ,	 62  ,	 25  ,	 10  ,	3 ] ,
	[	92	 ,	 53  ,	 27  ,	 13  ,	7 ] ,
	[	118	 ,	 46  ,	 28  ,	 17  ,	9 ] ,
	[	144	 ,	 39  ,	 28  ,	 19  ,	 14 ] ,
	[	170	 ,	 34  ,	 27  ,	 22  ,	 17 ] ,
	[	196	 ,	 29  ,	 26  ,	 24  ,	 21 ] ,
	[	224	 ,	 26  ,	 24  ,	 21  ,	 29 ] ,
	[	250	 ,	 24  ,	 22  ,	 20  ,	 34 ] ,
	[	276	 ,	 23  ,	 20  ,	 18  ,	 39 ] ,
	[	302	 ,	 20  ,	 18  ,	 16  ,	 46 ] ,
	[	328	 ,	 17  ,	 16  ,	 14  ,	 53 ] ,
	[	999	 ,	0  ,	0  ,	0  ,	0 ]
];

var scr_list = [
	[		25 , 66.67	 ],  [	   225 , 66.56	 ],  [	   625 , 66.44	 ],  [	  1225 , 66.33	 ],  [	  2025 , 66.22	 ],  [	  3025 , 66.10	 ],  [	  4225 , 65.99	 ],  [	  5625 , 65.87	 ],
	[	  7225 , 65.75	 ],  [	  9025 , 65.64	 ],  [	 11025 , 65.52	 ],  [	 13225 , 65.40	 ],  [	 15625 , 65.28	 ],  [	 18225 , 65.16	 ],  [	 21025 , 65.03	 ],  [	 24025 , 64.91	 ],
	[	 27225 , 64.79	 ],  [	 30625 , 64.66	 ],  [	 34225 , 64.54	 ],  [	 38025 , 64.41	 ],  [	 42025 , 64.29	 ],  [	 46225 , 64.16	 ],  [	 50625 , 64.03	 ],  [	 55225 , 63.90	 ],
	[	 60025 , 63.77	 ],  [	 65025 , 63.64	 ],  [	 70225 , 63.50	 ],  [	 75625 , 63.37	 ],  [	 81225 , 63.24	 ],  [	 87025 , 63.10	 ],  [	 93025 , 62.96	 ],  [	 99225 , 62.83	 ],
	[	105625 , 62.69	 ],  [	112225 , 62.55	 ],  [	119025 , 62.41	 ],  [	126025 , 62.26	 ],  [	133225 , 62.12	 ],  [	140625 , 61.98	 ],  [	148225 , 61.83	 ],  [	156025 , 61.69	 ],
	[	164025 , 61.54	 ],  [	172225 , 61.39	 ],  [	180625 , 61.24	 ],  [	189225 , 61.09	 ],  [	198025 , 60.94	 ],  [	207025 , 60.78	 ],  [	216225 , 60.63	 ],  [	225625 , 60.48	 ],
	[	235225 , 60.32	 ],  [	245025 , 60.16	 ],  [	255025 , 60.00	 ],  [	265225 , 59.84	 ],  [	275625 , 59.68	 ],  [	286225 , 59.51	 ],  [	297025 , 59.35	 ],  [	308025 , 59.19	 ],
	[	319225 , 59.02	 ],  [	330625 , 58.85	 ],  [	342225 , 58.68	 ],  [	354025 , 58.51	 ],  [	366025 , 58.33	 ],  [	378225 , 58.16	 ],  [	390625 , 57.98	 ],  [	403225 , 57.81	 ],
	[	416025 , 57.63	 ],  [	429025 , 57.45	 ],  [	442225 , 57.26	 ],  [	455625 , 57.08	 ],  [	469225 , 56.90	 ],  [	483025 , 56.71	 ],  [	497025 , 56.52	 ],  [	511225 , 56.33	 ],
	[	525625 , 56.14	 ],  [	540225 , 55.95	 ],  [	555025 , 55.76	 ],  [	570025 , 55.56	 ],  [	585225 , 55.36	 ],  [	600625 , 55.16	 ],  [	616225 , 54.95	 ],  [	632025 , 54.75	 ],
	[	648025 , 54.55	 ],  [	664225 , 54.34	 ],  [	680625 , 54.13	 ],  [	697225 , 53.92	 ],  [	714025 , 53.71	 ],  [	731025 , 53.49	 ],  [	748225 , 53.27	 ],  [	765625 , 53.05	 ],
	[	783225 , 52.83	 ],  [	801025 , 52.61	 ],  [	819025 , 52.38	 ],  [	837225 , 52.15	 ],  [	855625 , 51.92	 ],  [	874225 , 51.69	 ],  [	893025 , 51.46	 ],  [	912025 , 51.22	 ],
	[	931225 , 50.98	 ],  [	950625 , 50.74	 ],  [	970225 , 50.50	 ],  [	990025 , 50.25	 ],  [	 1010025 , 50.00	 ],  [	 1030225 , 49.75	 ],  [	 1050625 , 49.49	 ],  [	 1071225 , 49.23	 ],
	[	1092025 , 48.97	 ],  [	 1113025 , 48.71	 ],  [	 1134225 , 48.45	 ],  [	 1155625 , 48.18	 ],  [	 1177225 , 47.91	 ],  [	 1199025 , 47.64	 ],  [	 1221025 , 47.36	 ],  [	 1243225 , 47.08	 ],
	[	1265625 , 46.80	 ],  [	 1288225 , 46.52	 ],  [	 1311025 , 46.23	 ],  [	 1334025 , 45.93	 ],  [	 1357225 , 45.62	 ],  [	 1380625 , 45.31	 ],  [	 1404225 , 45.00	 ],  [	 1428025 , 44.68	 ],
	[	1452025 , 44.36	 ],  [	 1476225 , 44.03	 ],  [	 1500625 , 43.70	 ],  [	 1525225 , 43.36	 ],  [	 1550025 , 43.02	 ],  [	 1575025 , 42.68	 ],  [	 1600225 , 42.33	 ],  [	 1625625 , 41.98	 ],
	[	1651225 , 41.62	 ],  [	 1677025 , 41.26	 ],  [	 1703025 , 40.89	 ],  [	 1729225 , 40.52	 ],  [	 1755625 , 40.14	 ],  [	 1782225 , 39.76	 ],  [	 1809025 , 39.37	 ],  [	 1836025 , 38.98	 ],
	[	1863225 , 38.58	 ],  [	 1890625 , 38.18	 ],  [	 1918225 , 37.77	 ],  [	 1946025 , 37.36	 ],  [	 1974025 , 36.94	 ],  [	 2002225 , 36.51	 ],  [	 2030625 , 36.09	 ],  [	 2059225 , 35.65	 ],
	[	2088025 , 35.21	 ],  [	 2117025 , 34.77	 ],  [	 2146225 , 34.32	 ],  [	 2175625 , 33.86	 ],  [	 2205225 , 33.40	 ],  [	 2235025 , 32.93	 ],  [	 2265025 , 32.46	 ],  [	 2295225 , 31.98	 ],
	[	2325625 , 31.50	 ],  [	 2356225 , 31.01	 ],  [	 2387025 , 30.52	 ],  [	 2418025 , 30.02	 ],  [	 2449225 , 29.52	 ],  [	 2480625 , 29.01	 ],  [	 2512225 , 28.49	 ],  [	 2544025 , 27.97	 ],
	[	2576025 , 27.45	 ],  [	 2608225 , 26.92	 ],  [	 2640625 , 26.38	 ],  [	 2673225 , 25.84	 ],  [	 2706025 , 25.30	 ],  [	 2739025 , 24.74	 ],  [	 2772225 , 24.19	 ],  [	 2805625 , 23.63	 ],
	[	2839225 , 23.07	 ],  [	 2873025 , 22.50	 ],  [	 2907025 , 21.92	 ],  [	 2941225 , 21.35	 ],  [	 2975625 , 20.77	 ],  [	 3010225 , 20.18	 ],  [	 3045025 , 19.59	 ],  [	 3080025 , 19.00	 ],
	[	3115225 , 18.40	 ],  [	 3150625 , 17.80	 ],  [	 3186225 , 17.20	 ],  [	 3222025 , 16.60	 ],  [	 3258025 , 15.99	 ],  [	 3294225 , 15.38	 ],  [	 3330625 , 14.76	 ],  [	 3367225 , 14.15	 ],
	[	3404025 , 13.53	 ],  [	 3441025 , 12.91	 ],  [	 3478225 , 12.28	 ],  [	 3515625 , 11.65	 ],  [	 3553225 , 11.01	 ],  [	 3591025 , 10.37	 ],  [	 3629025 ,	9.73	 ],  [	 3667225 ,	9.09	 ],
	[	3705625 ,  9.09	 ],  [	 3744225 ,	9.09	 ],  [	 3783025 ,	9.09	 ],  [	 3822025 ,	9.09	 ],  [	 3861225 ,	9.09	 ],  [	 3900625 ,	9.09	 ],  [	 3940225 ,	9.09	 ],  [	 3980025 ,	9.09	 ],
	[	4020025 ,  9.09	 ],  [	 4060225 ,	9.09	 ],  [	 4100625 ,	9.09	 ],  [	 4141225 ,	9.09	 ],  [	 4182025 ,	9.09	 ],  [	 4223025 ,	9.09	 ],  [	 4264225 ,	9.09	 ],  [	 4305625 ,	9.09	 ],
	[	4347225 ,  9.09	 ],  [	 4389025 ,	9.09	 ],  [	 4431025 ,	9.09	 ],  [	 4473225 ,	9.09	 ],  [	 4515625 ,	9.09	 ],  [	 4558225 ,	9.09	 ],  [	 4601025 ,	9.09	 ],  [	 4644025 ,	9.09	 ],
	[	4687225 ,  9.09	 ],  [	 4730625 ,	9.09	 ],  [	 4774225 ,	9.09	 ],  [	 4818025 ,	9.09	 ],  [	 4862025 ,	9.09	 ],  [	 4906225 ,	9.09	 ],  [	 4950625 ,	9.09	 ],  [	 4995225 ,	9.09	 ],
	[	5040025 ,  9.09	 ],  [	 999999999 ,  0.00	 ]
];

( function() {

	// 所持スキル表示
	if(    location.pathname == "/user/"
		|| location.pathname == "/card/deck.php"
		|| location.pathname == "/card/trade_card.php"
		|| location.pathname.match(/union/)
	) {
		bro3dasuDrawSkill();
	}

	// 合成スキル表示
	if(    location.pathname == "/union/learn.php"
		|| location.pathname == "/busyodas/busyodas_continuty_result.php"
		|| location.pathname == "/busyodas/busyodas_result.php"
		|| location.pathname == "/card/trade.php"
		|| location.pathname == "/card/trade_card.php"
		|| location.pathname == "/card/exhibit_list.php"
		|| location.pathname == "/card/deck.php"
	){
		bro3dasuDrawCompositionSkill();
	}

})();

//--------------------------------------
// 武将スキル表示
//--------------------------------------
function bro3dasuDrawSkill() {
	if (location.pathname.match(/union/) == null) {
		// スキル枠
		if (location.pathname == "/card/trade_card.php") {
			j$("div[class*=card rarerity] span[class=status_frontback]").parent().after(
				'<span style="position:relative; top:-297px;">' +
					'<img src="http://' + location.hostname + '/20141224-01/extend_project/w945/img/card/common/bg_card_skill.png" style="position:relative; left:6px; z-index:-1">' +
					'<ul id="skillFrame" style="position:relative; top:-82px; left:14px; font-size:12px;"></ul>' +
				'</span>'
			);
		} else if (location.pathname == "/card/deck.php") {
			j$("div[class*=card rarerity] span[class=status_frontback]").parent().after(
				'<span style="position:relative; top:-293px;">' +
					'<img src="http://' + location.hostname + '/20141224-01/extend_project/w945/img/card/common/bg_card_skill.png" style="position:relative; left:6px; z-index:-1">' +
					'<ul id="skillFrame" style="position:relative; top:-82px; left:14px; font-size:12px;"></ul>' +
				'</span>'
			);
		} else {
			j$("div[class*=card rarerity] span[class=status_frontback]").parent().after(
				'<span style="position:relative; top:-125px;">' +
					'<img src="http://' + location.hostname + '/20141224-01/extend_project/w945/img/card/common/bg_card_skill.png" style="position:relative; left:6px; z-index:-1">' +
					'<ul id="skillFrame" style="position:relative; top:-82px; left:14px; font-size:12px;"></ul>' +
				'</span>'
			);
		}
	}

	// デッキ特別処理
	if( location.pathname == "/card/deck.php"){
		// ステータス強化ボタンの位置を移動
		j$("img[class=levelup]").css({"position":"relative", "top":"-160px", "left":"6px"});

		// スケスケ指定時はステータス強化ボタンを透明化
		if(SukesukeFlg == 1){
			j$("img[class=levelup]").css("opacity", "0.5");
		}
	}

	// 所持スキルを表示
	if( location.pathname == "/user/" || location.pathname == "/card/deck.php"	|| location.pathname == "/card/trade_card.php"){
		// プロフィール画面、デッキ画面
		j$("div[class*=cardWrapper]").each(
			function(){
				var skillText = "";
				j$("ul[class=back_skill] span[class*=skillName]", this).each(
					function(){
						skillText = skillText + "<li style='margin-top:3px !important;'>" + j$(this).text() + "</li>";
					}
				);
				j$("#skillFrame", this).html(skillText);
			}
		);
	} else if(location.pathname.match(/union/)) {
		// 合成画面
		if(location.pathname == "/union/learn.php") {
			j$("div[class*=cardWrapper] ul[class=front_skill]").remove();
		}
	}
}

//----------------------------------
// 合成スキル表示
//----------------------------------
function bro3dasuDrawCompositionSkill() {
	// 合成スキル枠
	if (location.pathname == "/union/learn.php") {
		j$("div[id=card_uraomote] div[class*=card rarerity] span[class=status_frontback]").parent().after(
			'<span style="position:relative; top:-194px;">' +
				'<img src="http://' + location.hostname + '/20141224-01/extend_project/w945/img/card/common/bg_card_skill.png" style="position:relative; top:70px; left:6px; z-index:-1">' +
				'<ul id="compositFrame" style="position:relative; top:-10px; left:14px; font-size:12px;"></ul>' +
			'</span>'
		);
	} else if (location.pathname == "/busyodas/busyodas_result.php" || location.pathname == "/busyodas/busyodas_continuty_result.php"){
		j$("div[class=getCardInfoArea] div[class*=card rarerity] span[class=status_frontback]").parent().after(
			'<span style="position:relative; top:-125px;">' +
				'<img src="http://' + location.hostname + '/20141224-01/extend_project/w945/img/card/common/bg_card_skill.png" style="position:relative; left:6px; z-index:-1">' +
				'<ul id="compositFrame" style="position:relative; top:-82px; left:14px; font-size:12px;"></ul>' +
			'</span>'
		);
	} else if (location.pathname == "/card/trade.php"){
		j$("div[class*=card rarerity] span[class=status_frontback]").parent().after(
			'<span style="position:relative; top:-125px;">' +
				'<img src="http://' + location.hostname + '/20141224-01/extend_project/w945/img/card/common/bg_card_skill.png" style="position:relative; left:6px; z-index:-1">' +
				'<ul id="compositFrame" style="position:relative; top:-82px; left:14px; font-size:12px;"></ul>' +
			'</span>'
		);
	} else if (location.pathname == "/card/trade_card.php"){
		j$("div[class*=card rarerity] span[class=status_frontback]").parent().after(
			'<span style="position:relative; top:-227px;">' +
				'<img src="http://' + location.hostname + '/20141224-01/extend_project/w945/img/card/common/bg_card_skill.png" style="position:relative; left:6px; z-index:-1">' +
				'<ul id="compositFrame" style="position:relative; top:-82px; left:14px; font-size:12px;"></ul>' +
			'</span>'
		);
	} else {
		j$("div[class*=card rarerity] span[class=status_frontback]").parent().after(
			'<span style="position:relative; top:-211px;">' +
				'<img src="http://' + location.hostname + '/20141224-01/extend_project/w945/img/card/common/bg_card_skill.png" style="position:relative; left:6px; z-index:-1">' +
				'<ul id="compositFrame" style="position:relative; top:-82px; left:14px; font-size:12px;"></ul>' +
			'</span>'
		);
	}

	// 合成スキル算出
	if (location.pathname != "/union/learn.php") {
		j$("div[class*=cardWrapper]").each(
			function(){
				var skill1NameInfo = j$("ul[class=back_skill] span[class*=skillName1 skill_name]", this);
				var cardName = j$("div[class*=omote_4sk] div[class=name] span[class=name]", this).text();
				if (skill1NameInfo.length != 0) {
					var compositionText = "";
					var skill1Info = skill1NameInfo.text().match(/[:：](.*)LV/);
					if (skill1Info == null) {
						compositionText = "<li style='margin-top:3px !important;'>合成表なし</li><li style='margin-top:3px !important;'>　</li><li style='margin-top:3px !important;'>　</li><li style='margin-top:3px !important;'>　</li>";
					} else {
						var skill1 = RegExp.$1.replace(/(^\s+)|(\s+$)/g, "");;
						if (typeof gousei_skill[skill1] != 'undefined') {
							for(var i = 0; i <=3; i++){
								var compSkill = gousei_skill[skill1][i];
								compositionText = compositionText + "<li style='margin-top:3px !important;'>" + gousei_skill[skill1][i] + "</li>";
							}
						} else {
							compositionText = "<li style='margin-top:3px !important;'>合成表なし</li><li style='margin-top:3px !important;'>　</li><li style='margin-top:3px !important;'>　</li><li style='margin-top:3px !important;'>　</li>";
						}

						if (cardName.indexOf("パンダ") > 0) {
							compositionText = "<li style='margin-top:3px !important;'>" + skill1 + "</li><li style='margin-top:3px !important;'>　</li><li style='margin-top:3px !important;'>　</li><li style='margin-top:3px !important;'>　</li>";
						}
					}
					j$("#compositFrame", this).html(compositionText);
				}
			}
		);
	} else {
		// 付与合成

		// ベースカードの情報取得
		var baseLv = j$("#bacecard div[class=level] span").text();
		var baseScoreInfo = j$("#bacecard span[class=score]").text().match(/スコア:(\d+)$/);
		var baseScore = RegExp.$1;
		var baseSkill = [];
		j$("#bacecard ul[class=back_skill] span[class*=skillName]").each(
			function(){
				var skillText = j$(this).text().match(/[：:](.*)LV/);
				if(skillText != null){
					baseSkill.push(RegExp.$1.replace(/(^\s+)|(\s+$)/g, ""));
				}
			}
		);

		// 素材カードの情報取得
		j$("#cardFileList div[class=cardColmn]").each(
			function() {
				var cardNo = j$("span[class=cardno]", this).text();
				var cardName = j$("span[class=name]", this).text();
				var level = j$("div[class=level] span", this).text();
				var scoreInfo = j$("span[class=score]", this).text().match(/スコア:(\d+)$/);
				var score = RegExp.$1;
				var att = parseFloat(j$("li[class=status_att]", this).text());
				var wdef = parseFloat(j$("li[class=status_wdef]", this).text());
				var int = parseFloat(j$("li[class=status_int]", this).text());

				// 合成確率算出
				var compositionText = "";
				var result = calcCompositionSkillRate(baseLv, baseScore, baseSkill, cardNo, cardName, level, score, att, wdef, int);
				if(result == null) {
					compositionText = "<li style='margin-top:3px !important;'>合成表なし</li><li style='margin-top:3px !important;'></li><li style='margin-top:3px !important;'></li><li style='margin-top:3px !important;'></li>";
				} else {
					for(var i = 0; i < result.length; i++) {
						compositionText = compositionText + "<li style='margin-top:3px !important; font-size:8pt;'>" + result[i].n + ":" + result[i].skill + "&nbsp;" + result[i].probability + "%</li>";
					}
				}

				// 画面描画
				j$("#compositFrame", this).html(compositionText);
				j$("div[class=control]", this).css("z-index", "5000");
			}
		);
	}
}

//----------------------------------
// 合成スキル確率算出
//----------------------------------
function calcCompositionSkillRate(baseLv, baseScore, baseSkills, useCardNo, useCardName, useLv, useScore, useAtk, useDef, useInt) {
	// 基礎確率の算出
	if (typeof card_list[useCardNo] == 'undefined') {
		return null;
	}

	// 合計LV・スコアの計算
	var total_lv	= parseInt(baseLv) + parseInt(useLv);
	var total_score = parseInt(baseScore) + parseInt(useScore);

	var score_table = 0;
	var lv_table	= 0;
	for (var x = 0; x < scr_list.length; x++) {
		if (scr_list[x][0] > total_score) {
			break;
		}
	}
	score_table = x;

	for (var x = 0; x < lv_list.length; x++) {
		if (lv_list[x][0] > total_lv) {
			break;
		}
	}

	lv_table = x;
	var probability = [ 0.00, 0.00, 0.00 ,0.00 ];
	probability[0] = (parseFloat( (1 - parseFloat(scr_list[score_table][1] / 100)) * parseFloat(lv_list[lv_table][1] / 100)) * 100).toFixed(2);	// 大
	probability[1] = (parseFloat( (1 - parseFloat(scr_list[score_table][1] / 100)) * parseFloat(lv_list[lv_table][2] / 100)) * 100).toFixed(2);	// 中
	probability[2] = (parseFloat( (1 - parseFloat(scr_list[score_table][1] / 100)) * parseFloat(lv_list[lv_table][3] / 100)) * 100).toFixed(2);	// 小
	probability[3] = (parseFloat( (1 - parseFloat(scr_list[score_table][1] / 100)) * parseFloat(lv_list[lv_table][4] / 100)) * 100).toFixed(2);	// 隠

	// 1ポイントあたりのステータス増分計算
	var pointAtk = parseFloat(card_list[useCardNo].a)  * 0.094;		// 攻撃
	var pointDef = parseFloat(card_list[useCardNo].d1) * 0.094;		// 防御
	var pointInt = parseFloat(card_list[useCardNo].i)  * 0.0016;		// 知力

	// 実際に割り振ったポイント数の計算
	var AlloPointAtk = parseInt((useAtk - parseFloat(card_list[useCardNo].a))  / pointAtk + 0.5);		// 攻撃
	var AlloPointDef = parseInt((useDef - parseFloat(card_list[useCardNo].d1)) / pointDef + 0.5);		// 防御
	var AlloPointInt = parseInt((useInt - parseFloat(card_list[useCardNo].i))  / pointInt + 0.5);		// 知力

	// 合成レシピ並び替え用配列
	var SkillArray = [];

	// 合成レシピと割り当てポイント数を配列に入れる
	if (useCardNo > 9000) {
		var panda_probability = 100;
		if (useCardName.indexOf("中指南") >= 0) {
			panda_probability = 50;
		} else if(useCardName.indexOf("小指南") >= 0) {
			panda_probability = 25;
		}
		for (var k = 0; k < 4; k++ ){
			probability[k] = panda_probability;
		}

		SkillArray.push( {"point":0, "n":"攻", "skill": card_list[useCardNo].bs, "probability":0.00, "flg":3 });		// 攻撃
		SkillArray.push( {"point":0, "n":"防", "skill": card_list[useCardNo].bs, "probability":0.00, "flg":2 });		// 防御
		SkillArray.push( {"point":0, "n":"知", "skill": card_list[useCardNo].bs, "probability":0.00, "flg":1 });		// 知力
		SkillArray.push( {"point":0, "n":"隠", "skill": card_list[useCardNo].bs, "probability":0.00, "flg":0 });		//
	}
	else {
		SkillArray.push( {"point":AlloPointAtk, "n":"攻", "skill": gousei_skill[card_list[useCardNo].bs][0], "probability":0.00, "flg":3 });		// 攻撃
		SkillArray.push( {"point":AlloPointDef, "n":"防", "skill": gousei_skill[card_list[useCardNo].bs][1], "probability":0.00, "flg":2 });		// 防御
		SkillArray.push( {"point":AlloPointInt, "n":"知", "skill": gousei_skill[card_list[useCardNo].bs][2], "probability":0.00, "flg":1 });		// 知力
		SkillArray.push( {"point":0,			"n":"隠", "skill": gousei_skill[card_list[useCardNo].bs][3], "probability":0.00, "flg":0 });		//
	}

	SkillArray.sort(
		function(a,b){
			if(a.point < b.point) return 1;
			if(a.point > b.point) return -1;
			if(a.flg   < b.flg	) return 1;
			if(a.flg   > b.flg	) return -1;
			return 0;
		}
	);

	// 合成確率を代入
	for (var x = 0; x < 3; x++) {
		SkillArray[x].probability = parseFloat(probability[x]);
	}
	// 合成確率でソート
	SkillArray.sort(
		function(a,b){
			if(a.probability < b.probability) return 1;
			if(a.probability > b.probability) return -1;
			return 0;
		}
	);
	// 隠しの合成確率は最後に代入 2013.01.18 追加
	SkillArray[3].probability = parseFloat(probability[3]);

	// 合成元カードに存在するスキルは表示しない
	var result = [];
	for (var x = 0; x < 4; x++) {
		var found = false;
		for (var j = 0; j < baseSkills.length; j++) {
			if(SkillArray[x].skill == baseSkills[j]) {
				found = true;
				break;
			}
		}
		if(found == false){
			result.push(SkillArray[x]);
		}
	}

	return result;
}
